{"Adventures/Arrest-of-the-Ashenfey-Assault":{"title":"Arrest of the Ashenfey Assault","links":["Bounty-Processing-Unit","Geàrd-Coille-Boireann","Verdanfey-Gate","Regions/The-Outback","Grim-Forest","Deities/The-Three-Sisters/Ashalla","Factions/Ashenfey","The-Ashenfey","The-Verdanfey","Green-Miasma-Zombies","Deities/The-Three-Sisters/Shadash","Radiant-Fantastic-Fireflies","Ashenfey-Gate","Misc/Elemental-Trees","Necrotic-Fantastic-Fireflies","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","Ash-Ticks","Necroly-poly","Seed-Zombies","Shambling-Mound","Guardian-Wolves","Guardian-Bear","Lusan-Boireann-Olc"],"tags":[],"content":"Found on the Bounty Processing Unit\nBPU Info\n\nClient: Geàrd Coille Boireann - guardian of the Verdanfey Gate\nLocation: The Outback - Grim Forest\nBrief: Geard has made an offer on behalf of her deity Ashalla to anyone that is willing to correct the behavior of Ashenfey intruders and destroy their gateway from the Ashenfey. They don’t have as much coin to offer as we would like since they are from Outback, and don’t care about money, but they have a magical artifact to sweeten the deal.\nReward: 1,500gp and a gift from the Verdanfey\n\nAdventure\nVerdanfey Features\n• Living creatures have “vulnerability” to healing.\n• Living creatures gain resistance to necrotic damage.\n• Undead creatures suffer a 1d4 penalty on attack rolls and saving throws.\nAshenfey Features\n• Living creatures have “resistance” to healing.\n• Living creatures gain vulnerability to necrotic damage.\n• Undead creatures enjoy a 1d4 bonus on attack rolls and saving throws.\nThe Fantastic Fireflies\nMost inhabitants of The Ashenfey desire to hunt and slaughter in The Verdanfey. Failing that, they will settle for access to the creatures of the prime material. Good druids and fey are on guard against these incursions, fighting to protect their charges from the hunger of the corrupt. While gateways to the Verdanfey are usually far from the analogous gateways to the Ashenfey, in\nsome places they are close together. Such gateways are created by the people of the Ashenfey to make their incursions more convenient. One such pair of gateways exists in the Grim Forest. The Verdanfey gateway was created to allow good and neutral creatures to assist in containing the Green Miasma Zombies that threatened the woods. Afraid of missing out, Shadash created a gateway to her Ashenfey, sending evil creatures to assist in this operation. After the zombies were contained, the gates remained active. At first, a tense truce existed in the area. But all too soon the creatures of the Ashenfey crossed over on hunting expeditions. To counter this, the fey protecting the Verdanfey gate recruited Radiant Fantastic Fireflies, fey swarms of radiant fireflies. These fireflies and their allies have limited the damage caused by the incursions from the Ashenfey, but the cost has been high.\nForest Gates\nThere are two gates in the Grim Forest. One leads to The Verdanfey and the other to The Ashenfey. The gates, which are rough circles of stones, are permanently active. Using a gate just requires moving into and then out of the circle. Moving back into and then out of the circle reverses the process. For example, if a creature starts out on the prime material plane and enters the Verdanfey Gate, it will enter the Verdanfey when it leaves the circle of stones. Returning to the circle and then leaving it will take them back to the prime material. The area around each gate is influenced by the fey realm it connects to, so the area around the Verdanfey gate is healthy and beautiful while the area around the Ashenfey Gate is sickly and greyish.\nVerdanfey Gate Map\nThe plant and animal life around the gate are healthier and more robust than normal, thanks to the positive influence of the Verdanfey. There are also trees growing around the gate that are not native to the prime material plane. A DC 15 Intelligence (Nature) check will reveal that the trees are from the Verdanfey.\nVerdanfey Map\nThis is the other side of the gate. The Yellow trees are Radiant Elemental Trees and each is home to a swam of radiant butterflies or radiant fantastic fireflies. Geàrd Coille Boireann’s house is located here. It is a living structure, growing up from the ground.\nAshenfey Gate Map\nThe area around the Ashenfey gate is tainted and corrupted by the negative energy of the Ashenfey. The plants are less healthy than elsewhere in the woods and natural animals instinctively avoid the area.\nAshenfey Map\nThis is the other side of the gateway. The Ashenfey is a grey and bleak place, the concentrated\nmanifestation of what most creatures would see as the negative aspects of the natural world.\nThe gate stones are surrounded by Necrotic Elemental Trees, each of which is the home to necrotic flies or Necrotic Fantastic Fireflies. Some of these trees can be the special Necrotic Trees that attack living creatures; the creatures of the Ashenfey avoid getting too close to those trees. Lusan’s hut, which is made from wood, bones, and tanned humanoid skins, is located on the hill.\nOn The Side Of The Verdanfey\nGeàrd will ask that Unit BH-Umbra Δ9 slay the Ashenfey creatures in the forest, enter the Ashenfey and defeat Lusan, and then close the gate by destroying at least half the stones or removing at least half of them from the circle.\n1. Battle At The Verdanfey Gate\nCoincidentally, the gate will come under attack when the PCs depart The Verdanfey. The default attack will be four Ash Ticks hunting for deer. This can be adjusted for an easier or more challenging encounter. They will turn their attention from the deer to the PCs, attacking until destroyed.\n2. Battle In The Woods\nRather than having a long grind of fighting the Ashenfey creatures, the PCs can have one battle in\nthe woods before reaching the Ashenfey gate. The other fighting will be done by Geard and her allies; the PCs can hear combat as they press towards the gate. But if the players enjoy a grind, more encounters can take place. The default battle in the woods pits the PCs against four Necroly-poly bugs, but this can be adjusted to make the fight easier or harder.\n3. Battle At The Ashenfey gate\nAs Lusan sees herself as being on the offensive, she does not post guards at the gate. But when the PCs arrive, they will encounter three Ash Ticks and three Necro-poly bugs in the area. While the insects would happily eat each other, they much prefer the taste of prime material and Verdanfey creatures. As such, while they will not cooperate, they will focus on killing the PCs. Because of her philosophical views, Lusan will not assist the insects even if she is aware of the battle. Also, she knows that they are just as likely to go after her as the PCs, should she get close to them.\n4. Battle In The Ashenfey\nIf the PCs enter the Ashenfey, they will initially encounter the necrotic fly swarms living in the\nNecrotic Trees. The default attack consists of four swarms, this can be adjusted for difficulty. There can also be one or more of the Necrotic Elemental Trees that can sense and attack living creatures.\nIf Lusan notices the PCs entering the Ashenfey or trying to destroy the gate, she will move to confront them. In the default encounter, she will have four Seed Zombies and one swarm of fantastic necrotic fireflies with her. The difficulty can be increased slightly by adding more seed zombies or fireflies or increased substantially by adding the Shambling Mound. Unless the PCs immediately attack, Lusan will attempt to convince them to switch sides, promising them a suitable reward for their efforts. If they agree, she will send them on their way and await their\nsuccess or failure. If she cannot convince them to switch sides, she will try to persuade them to stay out of the fight, insisting that the battle is between her and Geàrd Coille Boireann. If the PCs leave, she will allow them to depart. If they refuse to leave or take hostile action, she will attack.\n5. Destroying The Gate\nA typical stone is AC 17 and takes 27 points of damage to destroy (enough damage to disrupt the\nmagic). If desired, the stone can be treated somewhat realistically as being immune to slashing and piercing damage from most handheld weapons (picks being an obvious exception).\nIf a stone is destroyed, it will emit a burst of necrotic energy in a 20-foot radius sphere. Each creature in that area must make a DC 15 Constitution saving throw, taking 11 (3d6) necrotic damage on a failed save, or half as much damage on a successful one. The typical stone weighs about 2,500 pounds, should the PCs decide to move them. If at least half the stones are moved (at least 40 feet away from all other stones) or destroyed, the gateway fails and closes.\n6. Battle At The Verdanfey Gate (Optional)\nThe gate is guarded by a pack of six Guardian Wolves and a Guardian Bear. When the PCs attack, a\nwolf will be sent to warn Geard. If the guardians are killed before they can warn Geard, the PCs might be able to catch her by surprise.\n7. Battle In The Verdanfey (Optional)\nIf the PCs enter the Verdanfey and are engaged in hostilities, they will be attacked by the radiant\nbutterfly swarms living in the Radiant Trees. The default attack consists of four swarms, this can be\nadjusted for difficulty. There can also be one or more of the special Radiant Trees that can sense and attack living creatures. Unless the PCs immediately attack, Geard will attempt to convince them to stay on her side, promising them she is a better Ally than Lusan. If they agree, she will send them on their way and await their success or failure. If she cannot convince them to stay on her side, she will try to persuade them to stay out of the fight, insisting that the battle is between her and the Lusan Boireann Olc, and she never should have asked in the first place. She will also refuse pay. If the PCs leave, she will allow them to depart. If they refuse to leave or take hostile action, she will attack."},"index":{"title":"Welcome to Stickyickistan","links":["Sources/Eberron","Sources/Ravnica","Sources/Dragonlance","Stickyickistan","Regions/The-Outback"],"tags":[],"content":"Welcome to Stickyickistan\nStickyickistan is my homebrewed D&amp;D world, a melting pot of various settings blended into one expansive and ever-evolving universe. Intentional ambiguity allows the world to function as an open sandbox, giving both my players and me, as the DM, the freedom to explore limitless possibilities without rigid constraints.\nThis world draws inspiration from multiple established settings, including the Forgotten Realms, Eberron, Ravnica, Dragonlance, and Spelljammer, with each faction and influence uniquely flavored to fit the distinct tone of Stickyickistan. It tries to weaves together elements of medieval fantasy, cyberpunk, and steampunk, creating a rich and often chaotic world where magic, technology, and intrigue collide—sometimes in ways that defy logic, but that’s part of the fun.\nAt the heart of the setting lies the sprawling metropolis of Stickyickistan, a city teeming with adventure, mystery, and danger. Whether navigating the city’s labyrinthine alleyways, dealing with powerful guilds and shadowy organizations, or uncovering lost relics of forgotten civilizations, adventurers will find no shortage of opportunities. Beyond the city stretches The Outback, a wild and unpredictable frontier filled with untamed magic, forgotten ruins, and lawless territories waiting to be explored."}}