{"Adventures/Arrest-of-the-Ashenfey-Assault":{"title":"Arrest of the Ashenfey Assault","links":["Bounty-Processing-Unit","Geàrd-Coille-Boireann","Verdanfey-Gate","Regions/The-Outback","Grim-Forest","Deities/The-Three-Sisters/Ashalla","Factions/Ashenfey","The-Ashenfey","The-Verdanfey","Green-Miasma-Zombies","Deities/The-Three-Sisters/Shadash","Radiant-Fantastic-Fireflies","Ashenfey-Gate","Misc/Elemental-Trees","Necrotic-Fantastic-Fireflies","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","Ash-Ticks","Necroly-poly","Seed-Zombies","Shambling-Mound","Guardian-Wolves","Guardian-Bear","Lusan-Boireann-Olc"],"tags":[],"content":"Found on the Bounty Processing Unit\nBPU Info\n\nClient: Geàrd Coille Boireann - guardian of the Verdanfey Gate\nLocation: The Outback - Grim Forest\nBrief: Geard has made an offer on behalf of her deity Ashalla to anyone that is willing to correct the behavior of Ashenfey intruders and destroy their gateway from the Ashenfey. They don’t have as much coin to offer as we would like since they are from Outback, and don’t care about money, but they have a magical artifact to sweeten the deal.\nReward: 1,500gp and a gift from the Verdanfey\n\nAdventure\nVerdanfey Features\n• Living creatures have “vulnerability” to healing.\n• Living creatures gain resistance to necrotic damage.\n• Undead creatures suffer a 1d4 penalty on attack rolls and saving throws.\nAshenfey Features\n• Living creatures have “resistance” to healing.\n• Living creatures gain vulnerability to necrotic damage.\n• Undead creatures enjoy a 1d4 bonus on attack rolls and saving throws.\nThe Fantastic Fireflies\nMost inhabitants of The Ashenfey desire to hunt and slaughter in The Verdanfey. Failing that, they will settle for access to the creatures of the prime material. Good druids and fey are on guard against these incursions, fighting to protect their charges from the hunger of the corrupt. While gateways to the Verdanfey are usually far from the analogous gateways to the Ashenfey, in\nsome places they are close together. Such gateways are created by the people of the Ashenfey to make their incursions more convenient. One such pair of gateways exists in the Grim Forest. The Verdanfey gateway was created to allow good and neutral creatures to assist in containing the Green Miasma Zombies that threatened the woods. Afraid of missing out, Shadash created a gateway to her Ashenfey, sending evil creatures to assist in this operation. After the zombies were contained, the gates remained active. At first, a tense truce existed in the area. But all too soon the creatures of the Ashenfey crossed over on hunting expeditions. To counter this, the fey protecting the Verdanfey gate recruited Radiant Fantastic Fireflies, fey swarms of radiant fireflies. These fireflies and their allies have limited the damage caused by the incursions from the Ashenfey, but the cost has been high.\nForest Gates\nThere are two gates in the Grim Forest. One leads to The Verdanfey and the other to The Ashenfey. The gates, which are rough circles of stones, are permanently active. Using a gate just requires moving into and then out of the circle. Moving back into and then out of the circle reverses the process. For example, if a creature starts out on the prime material plane and enters the Verdanfey Gate, it will enter the Verdanfey when it leaves the circle of stones. Returning to the circle and then leaving it will take them back to the prime material. The area around each gate is influenced by the fey realm it connects to, so the area around the Verdanfey gate is healthy and beautiful while the area around the Ashenfey Gate is sickly and greyish.\nVerdanfey Gate Map\nThe plant and animal life around the gate are healthier and more robust than normal, thanks to the positive influence of the Verdanfey. There are also trees growing around the gate that are not native to the prime material plane. A DC 15 Intelligence (Nature) check will reveal that the trees are from the Verdanfey.\nVerdanfey Map\nThis is the other side of the gate. The Yellow trees are Radiant Elemental Trees and each is home to a swam of radiant butterflies or radiant fantastic fireflies. Geàrd Coille Boireann’s house is located here. It is a living structure, growing up from the ground.\nAshenfey Gate Map\nThe area around the Ashenfey gate is tainted and corrupted by the negative energy of the Ashenfey. The plants are less healthy than elsewhere in the woods and natural animals instinctively avoid the area.\nAshenfey Map\nThis is the other side of the gateway. The Ashenfey is a grey and bleak place, the concentrated\nmanifestation of what most creatures would see as the negative aspects of the natural world.\nThe gate stones are surrounded by Necrotic Elemental Trees, each of which is the home to necrotic flies or Necrotic Fantastic Fireflies. Some of these trees can be the special Necrotic Trees that attack living creatures; the creatures of the Ashenfey avoid getting too close to those trees. Lusan’s hut, which is made from wood, bones, and tanned humanoid skins, is located on the hill.\nOn The Side Of The Verdanfey\nGeàrd will ask that Unit BH-Umbra Δ9 slay the Ashenfey creatures in the forest, enter the Ashenfey and defeat Lusan, and then close the gate by destroying at least half the stones or removing at least half of them from the circle.\n1. Battle At The Verdanfey Gate\nCoincidentally, the gate will come under attack when the PCs depart The Verdanfey. The default attack will be four Ash Ticks hunting for deer. This can be adjusted for an easier or more challenging encounter. They will turn their attention from the deer to the PCs, attacking until destroyed.\n2. Battle In The Woods\nRather than having a long grind of fighting the Ashenfey creatures, the PCs can have one battle in\nthe woods before reaching the Ashenfey gate. The other fighting will be done by Geard and her allies; the PCs can hear combat as they press towards the gate. But if the players enjoy a grind, more encounters can take place. The default battle in the woods pits the PCs against four Necroly-poly bugs, but this can be adjusted to make the fight easier or harder.\n3. Battle At The Ashenfey gate\nAs Lusan sees herself as being on the offensive, she does not post guards at the gate. But when the PCs arrive, they will encounter three Ash Ticks and three Necro-poly bugs in the area. While the insects would happily eat each other, they much prefer the taste of prime material and Verdanfey creatures. As such, while they will not cooperate, they will focus on killing the PCs. Because of her philosophical views, Lusan will not assist the insects even if she is aware of the battle. Also, she knows that they are just as likely to go after her as the PCs, should she get close to them.\n4. Battle In The Ashenfey\nIf the PCs enter the Ashenfey, they will initially encounter the necrotic fly swarms living in the\nNecrotic Trees. The default attack consists of four swarms, this can be adjusted for difficulty. There can also be one or more of the Necrotic Elemental Trees that can sense and attack living creatures.\nIf Lusan notices the PCs entering the Ashenfey or trying to destroy the gate, she will move to confront them. In the default encounter, she will have four Seed Zombies and one swarm of fantastic necrotic fireflies with her. The difficulty can be increased slightly by adding more seed zombies or fireflies or increased substantially by adding the Shambling Mound. Unless the PCs immediately attack, Lusan will attempt to convince them to switch sides, promising them a suitable reward for their efforts. If they agree, she will send them on their way and await their\nsuccess or failure. If she cannot convince them to switch sides, she will try to persuade them to stay out of the fight, insisting that the battle is between her and Geàrd Coille Boireann. If the PCs leave, she will allow them to depart. If they refuse to leave or take hostile action, she will attack.\n5. Destroying The Gate\nA typical stone is AC 17 and takes 27 points of damage to destroy (enough damage to disrupt the\nmagic). If desired, the stone can be treated somewhat realistically as being immune to slashing and piercing damage from most handheld weapons (picks being an obvious exception).\nIf a stone is destroyed, it will emit a burst of necrotic energy in a 20-foot radius sphere. Each creature in that area must make a DC 15 Constitution saving throw, taking 11 (3d6) necrotic damage on a failed save, or half as much damage on a successful one. The typical stone weighs about 2,500 pounds, should the PCs decide to move them. If at least half the stones are moved (at least 40 feet away from all other stones) or destroyed, the gateway fails and closes.\n6. Battle At The Verdanfey Gate (Optional)\nThe gate is guarded by a pack of six Guardian Wolves and a Guardian Bear. When the PCs attack, a\nwolf will be sent to warn Geard. If the guardians are killed before they can warn Geard, the PCs might be able to catch her by surprise.\n7. Battle In The Verdanfey (Optional)\nIf the PCs enter the Verdanfey and are engaged in hostilities, they will be attacked by the radiant\nbutterfly swarms living in the Radiant Trees. The default attack consists of four swarms, this can be\nadjusted for difficulty. There can also be one or more of the special Radiant Trees that can sense and attack living creatures. Unless the PCs immediately attack, Geard will attempt to convince them to stay on her side, promising them she is a better Ally than Lusan. If they agree, she will send them on their way and await their success or failure. If she cannot convince them to stay on her side, she will try to persuade them to stay out of the fight, insisting that the battle is between her and the Lusan Boireann Olc, and she never should have asked in the first place. She will also refuse pay. If the PCs leave, she will allow them to depart. If they refuse to leave or take hostile action, she will attack."},"Adventures/Bugs--and--Bloodhounds":{"title":"Bugs & Bloodhounds","links":["Gilded-Nug","NPC's/Wes-Scantlin","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Player-Characters/Fungi","POI's/Ashen-Citadel","Items/A.S.S-sending-stones","POI's/The-Rusted-Chalice","Combat-Training-Facility","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","Gilded-Blunt","NPC's/Zara-Blackthorn","Warforged","C0B4LT","Misc/Zooka-Malt","Misc/Arcannabis","NPC's/Kezrin-Malvek","NPC's/Velindra-Ashveil","Bounty-Processing-Unit","Ashen-Archives","Player-Characters/Xon","Misc/Arcannabis-Cultivation","NPC's/Arcana-Belle","NPC's/Sizzle-Scorchmane","NPC's/Sir-Ashwyn-Highblade","NPC's/Solmenda","NPC's/Thistlebog","Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII","Dragonborn","Items/Sigil-Bound-Gate-Band","POI's/Puffer's-Pottery","Species/Wererats","Factions/The-Plague-Plugz","POI's/Blunts-Blades-and-Bongs","Cough-City-Thugs","Regions/Bongstad","Regions/Upper-South-Booftown","POI's/The-Green-Grimoire","Necrotic-Fly-swarms","Ash-Ticks","Necroly-poly","Mothman","Aberrant-Moths","Adventures/Arrest-of-the-Ashenfey-Assault","Adventures/Retrieval-of-the-Shaded-Reflection","Adventures/Unit-BH-IgnisΩ5-K.I.A"],"tags":[],"content":"General:\n\nThe Gilded Nug was successfully retrieved by the squad and Wes Scantlin was defeated once and for all\nAshen Shadow Society info tech’s were able to use some info from Fungi when he returned, and the company scrying system to direct an Airship to the Gapejaw Bog to look for the squad or their remains\nUpon their return to the Ashen Citadel, the squad is escorted to a managerial part of the Citadel where they are given A.S.S sending stones, and codes that allow them to access new areas of the citadel\nThe new areas they can access are The Rusted Chalice, The Airship Hangar, and A Combat Training Facility\nThey are informed of their successful probation period, and promotion from a Novice Squad to Bloodhounds of A.S.S. During this time, some tech’s have been sent to their quarters to upgrade/install things to match their new rank.\nSince they are out of probation they are officially given their guild mandated USID (unique squad identifier) which is Unit BH-Umbra Δ9\nThey each receive 3000gp and use 1500gp each to fund the upgrades to their quarters\nWithin a few days, the lab tech’s are able to decipher the ancient allegory about the Gilded Nug, and they discover that the gilded nug can be broken down using a magical grinder, and rolled in magical gilded hemp leaf to make 3 Gilded Blunts. These 3 blunts hold immense magical power, and allow anyone that smokes them to use the Wish spell before it turns to ash\nThese blunts will be given to the party when it is deemed necessary\nWhen they return to their quarters, it looks mostly the same, and still smells like unfettered butt musk, but it feels a bit larger. A few mushrooms are propped against the wall in a dim corner, and some new machines have been placed along the wall next to an upgraded alchemy table. They have also added some decor around the room. Mostly utility things like a large chest for storage and some shelving units.\n\nIdeas:\n\nMake a scenario where they go to the shopping district to use their new money, and while they are there, they get attacked by a squad of rival bounty hunters from THC that are trying to kill them for the money that Hazeus Tokenheim put on their heads.\nMake a mission where they are asked to help Fungi get rid of his bug brain curse by going through a custom made trial in the combat training facility\nThe combat training facility is a giant magitech machine that is capable of simulating realistic, fully interactive environments, and creatures of all kinds. If a bounty hunter is to drop to 0HP in the combat training facility, and they fail death saves, they are immediately transported out of the machine and wake up in the Citadel infirmary with a minimum 2 levels of exhaustion. They are able to rejoin their squad in the training mission, or bow out of the exercise.\nTwo kinds of Arcannabis seeds:\nPre-enchanted seeds are seeds purchased from a licensed grower with stable genetics. This means the effects of the plant it will grow are already known and are guaranteed to be correct. Pre-enchanted seeds will take only a month of in game time to finish, and they will produce enough for 3 joints/blunts/bowls\nVirgin Seeds are wild seeds that have been procured from the Outback, and need to be enchanted before they can be planted. If they are planted without being enchanted first, there is only a 25% chance (DC16 Nature) it will produce Arcannabis, and the effect will be a random cantrip. The other 75% of the seeds will be non-magical cannabis. To enchant a Virgin seed, all materials used in the spell being used in the enchantment must be sacrificed along with (1d4 + spell level x 10) gp. Seeds can be harvested from the plant a Virgin seed produces, and a DC 13 Nature(Wisdom) check will determine if the genetics have been stabilized or not. The number of generations the strain has gone through can be added to the Nature check. For example if they enchant a seed, plant it, harvest seeds from the plant instead of flowers, and fail the Nature check, the new seeds they harvested will add a +1 to the nature roll. If they fail the Nature check a second time the newest seeds will add a +2 to the Nature roll.\nwww.dndspeak.com/2019/03/26/100-fantasy-drugs-and-their-effects/\n\nFungi:\nFungi was spotted on the ASS scrying system just outside city limits hauling ass through the forest. Zara Blackthorn was informed and sent a Novice squad to go get him. When they eventually found him, he was on the industrial side of town sifting through a bunch of waste material from a hemp paper processing plant. When asked what happened and why he wasn’t with his party he spoke incoherently, and it became obvious to the rescue party that Fungi is now suffering from an insect infestation in his body. This affects him in a few ways:\n\nDisadvantage on Concentration Checks: The constant movement of bugs makes it hard to maintain focus during spellcasting.\nDamage Over Time: At the start of each long rest, they must succeed on a DC 13 Constitution saving throw or take 1d4 piercing damage as the bugs bite into their body. This damage cannot be reduced by resistance.\nDistracting Noise: The constant buzzing and skittering causes disadvantage on Wisdom (Perception) checks relying on hearing.\nSpell Interference: The bugs occasionally disrupt the Warforged’s druidic magic. When casting a spell, they must roll a d20. On a roll of 1, the spell fizzles and is wasted.\nThis infestation can be dispelled with a wish spell or greater restoration.\n\nZara will also have Fungi be brought in to chew him out for abandoning the mission, and letting him know that for this fuck up he now has 2 of 3 strikes against him during his probation period in the guild. A third strike will result in him being permanently assigned to the Ashen Support Squad (a fate that most likely means he will die on a mission way out of his depth). A third strike will be given based on Zara’s own discretion.\nThe Rusted Chalice:\nThe Rusted Chalice is where all the ranked squads can go to socialize. Imagine a medieval tavern and a hookah lounge from 3005 fucked and gave birth to the Rusted Chalice. Scantily clad droid waitresses serve the patrons seated at tables and booths, and a Warforged with elf-like features stands behind the bar named C0B4LT. The bar serves Zooka Malt and some hard spirits made from Arcannabis.\nSide Quest NPC’s:\nKezrin Malvek\nVelindra Ashveil\nAirship Port &amp; Hangar Bay:\nThe Hangar Bay is where ASS keeps their fleet of airships, and services them when they need maintenance. The Airship Port is an opulent deck off the side of the citadel over the city streets below where the company Airships leave from and incoming Airships are received.\nSquad Quarters:\nThe squad’s quarters have been fitted with some new decor, and tools to help the party. First off the tech’s updated the software version of their BPU (Bounty Processing Unit) which has a nicer looking UI, and access to info the old system wasn’t capable of getting from the Ashen Archives. Secondly they have installed an alchemy/herbology station where Xon can use their alchemy skills to make potions, and enchant seeds, and there is a rudimentary setup for Arcannabis Cultivation.\nArcane Healers:\nArcana Belle\nTHC Rivals:\nSizzle Scorchmane\nSir Ashwyn Highblade\nSolmenda\nThistlebog\nTribunal Highblade Coalition Encounter:\nDusk Flame VII will set up an ambush on the party in the downtown area. When the time feels right, have the THC squad minus Thistlebog, and Ashwyn roll a group stealth. If it is low enough, a PC’s passive perception may be able to spot them. If they get spotted before they can enact the ambush plan with Thistlebog waiting on a rooftop up ahead, describe to the party what they see:\nYou turn around and notice a trio of individuals a fair distance back that stand out from the regular crowd of commoners. A tall blonde woman in a flowing flower dress with a sigil adorned staff, and a Red Dragonborn wearing high quality armor with a sword at his waist. You keep walking for a moment, and realize they are following you.\nIf the party makes it obvious that they have spotted the duo of THC members, and or try approaching them, Sizzle will contact Thistlebog with a sending stone to call off the plan, and Solmeda will use her Sigil Bound Gate Band to get them away, and their ambush plans have been foiled. \nAs you make it clear that you have seen your pursuers, in an instant, you see the dragonborn grab something from a pouch on his waist and speak into it while the tall blonde woman traces a circular sigil in the air. In an instant, she completes the somatic motion, and they are encircled by a ring of spectral sigils at the waist. The sigil rings collapse on them and they vanish in front of your eyes.\nIf the THC members go unnoticed, they will tail the party to the location where Thistlebog, and Ashwyn lie in wait.\nWhen the party is in Thistlebog’s range, have all PC’s make a perception check. This perception check must beat a stealth roll from Thistlebog. Thistlebog will be attempting to hide on a nearby stair accessible rooftop. If any PC’s are able to spot him, they will notice him looking directly at whoever is the closest target for him to hit, mutter something to himself, then pull out a blowgun and green-tipped needles. Roll initiative. If the PC’s are unable to spot him, Thistlebog will cast his hunter’s mark on the closest target, and then shoot them with his blowgun, and signal his squad via sending stone to move in for the kill. Roll Initiative. Ashwyn, and Thistlebog will have 6 temp HP to start the fight due to Sir Ashwyn’s Inspiring leader feat. At any point during the fight, if any of the THC members are mortally threatened, Solmenda will use her Sigil Bound Gate Band to teleport them all out of the fight. During the fight Sizzle, and Ashwyn will intro themselves like fucking anime villains explaining a little about who they are, and why they are trying to kill the party. \n“It’s just business. You understand.”\nThis encounter either ends in a TPK, THC squad teleporting away at the last second, or they somehow figure out how to stop Solmenda from teleporting them away to safety, and the THC are eliminated. If they eliminate the THC squad, the price on their head will raise to 1000gp each, and another stronger squad will come after them.\nPuffer’s Pottery:\nWererats The Plague Plugz Gang\nYou walk in and smell the strong smell of arcannabis smoke. A slender man stands behind the counter, and the walls are lined with clay pots of varying quality.\nHave each PC make a DC 10 Perception to see the thieves can’t on the wall when they walk in\nA DC 12 Perception will see the metal box under the counter, and the fact that the man behind the counter isn’t smoking.\nPuffer is behind the counter. When the party walks in, he will say nothing, just look them up and down with a bit of a puzzled look, and then look up at the thieves can’t above the curtain. All PC’s will notice. If they don’t ask anything about it he will try to quickly sell them some pottery for very cheap and get them out the door. If they do inquire about poison, or bring up the thieves can’t, he will say:\nTwo at a time.\nThen he will walk slowly over to the curtain and pull it to the side, motioning them into the next room. When the  party has decided who they are sending in Puffer will say:\nThe stairs are just over there…\nFrom here it should be pretty straightforward.\nThe staircase leads to a dimly lit room with the smell of stale tobacco smoke and bad body odor enters your nostrils as you descend the stairs. The room is dimly lit with candles supplementing the lack of light. Barrels and crates line the walls to keep a main pathway open. A large table pushed against the wall has a multitude of colored bottles and folded paper envelopes lining the\nedges of the table.\nNext Session:\nNext session will start on the airship they were scooped up in at the end of the last session, on the way to the Citadel. Go over what is in the General section above. From there, the party will have some options that they can do in any order. \nIntro:\n\nThe opening scene will be the party and Zara sans Fungi returning to the Ashen Citadel airship port. Light RP conversations about the last session.\nAs they converse about the fall of Wes Scantlin, Zara walks them from the airship port to her office where Fungi is waiting.\nWhen they get to her office, explain Fungi’s infestation, how they found him, the A.S.S sending stones, and payment for the mission, which they all already have on their sheets. Also explain the changes made to Wraith and Baeriggs magic items they purchased from BBB in the first session. Apologize cause you done fucked up by not realizing they weren’t finished for the first session since you worked on it so long ago.\nExplain that Fungi must complete a mandatory disciplinary combat training exercise before they are allowed to take on any new work.\nAfter this, tell them that their quarters are being renovated for the next few hours, so they should go find somewhere else to hang out in the meantime. This would be a good time to bring up The Rusted Chalice that they can also go check out now. It is about 3:00 pm at this point though, so there isn’t anyone there other than C0B4LT, and Kezrin Malvek until later. Zara will mention it likely won’t be busy, but it’s open 24/7.\nZara will say, if they head downtown to go shopping, there is also a magi-mediclinic run by a trusted acquaintance, Arcana Belle, that will be able to cure Fungi’s infestation without a hitch.\nThey are also free to complete Fungi’s disciplinary combat training exercise at any time.\n\nShopping:\nAsk which shops they are going to. Any Shop they can go to other than BBB is downtown. If they go to Blunts Blades and Bongs, group DC 12 stealth or intimidation, or they encounter Cough City Thugs when they leave since to get to Bongstad you must go through Upper South Booftown CCC territory. If they go to The Green Grimoire, on the way there, have each PC make a Perception roll. On a 12, Baeriggs will notice that as they pass a particular store, Puffer’s Pottery, the sign has some writing in a language he vaguely knows that isn’t Dwarvish or Common. On a 14, anyone can notice the person behind the counter of this store has some suspiciously rat-like features like the tip of a tail poking out of their pants, and hair in strange places. If they decide to go in, refer to the Puffer’s Pottery section of the document.\nAny other shops they can shop in peace. After they are done shopping, they will get ambushed by Dusk Flame VII, the bounty hunting squad that Hazeus Tokenheim hired to kill them. When they finally return to the Citadel, their quarters will be finished, and accessible again. Here is where to introduce the new BPU system. However, they can’t use it until they have completed Fungi’s disciplinary combat training exercise. Here they can do the following if they have yet to complete them, and meet the requirements to do them:\n\nFungi’s disciplinary combat training exercise\nKezrin’s Giant Centipede Hunt\nReturn to the Rusted Chalice\nSee Arcana Belle\nSee Vindra Stitch\nGo to bed I guess lol\nDo something completely unexpected lmao\n\nFungi’s Disciplinary Combat Training Exercise:\nThis section is just a run through four combat scenarios that get increasingly harder. The party can benefit from a short rest between each simulation.\n1. Ankheg’s Nest - MD\n\n3 Ankheg\n3 Necrotic Fly swarms\n\n2. Arachnid Assault - HD\n\n6 Spiders\n1 Phase Spider\n3 Ash Ticks\n1 Necroly-poly\n\n3. Kraul Frontlines - HD\n\n4 Kraul Warriors\n2 Winged Kraul Warriors\n1 Kraul Death Priest\n\n4. Mothman - DD\n\n1 Mothman\n2 Aberrant Moths\n\nKezrin’s Giant Centipede Hunt:\nThis is a small encounter where the party accompanies Kezrin into the Outback. He leads them to a place where he knows there will be plenty of Giant Centipedes. The PC’s and Kezrin will encounter 8 Giant Centipedes in a clearing or on a path in the Outback not too far outside the city. This combat should be trivial for them.\nBPU (Bounty Processing Unit)\nArrest of the Ashenfey Assault:\nRetrieval of the Shaded Reflection:\nUnit BH-IgnisΩ5 K.I.A\nNotes\n\nTAKE A SECOND TO CORRECT DICE FORMULAS IN FOUNDRY\nARMOR THAT CHANGES APPEARANCE\nSEED SHOP\n"},"Adventures/Retrieval-of-the-Shaded-Reflection":{"title":"Retrieval of the Shaded Reflection","links":["Bounty-Processing-Unit","Lady-Mizzera-Ambruson","Nevercough-Museum","Regions/Bongstad","The-Dark-Devourer","Sick-Spawn","Silent-Spawner","Triple-Threat","Gold-Guard","Jade-Jackal","Crimson-Carver","Jade-Jackal-Spawn"],"tags":[],"content":"Found on the Bounty Processing Unit\nBPU Info\n\nClient: Lady Mizzera Ambruson - Arcane Artifacts Curator of the Nevercough Museum\nLocation: Bongstad\nBrief: During excavation for a new residential development in Bongstad, the crew broke into a cave. The company sent some workers down to inspect what they had uncovered, but only one returned. What he described was pretty harrowing. His testimony was spread around, and caught the attention of Lady Mizzera Ambruson from the Nevercough Museum. She believes what he described could lead to the discovery of a fabled magical artifact that she would pay a grandiose amount of money for.\nReward: 8,000gp\n\nAdventure\n1. Descending Down\nThe party begins their descent into a deep cave with enough room to enter in a comfortable single file. With their marching order decided and lighting situation covered, read the following out loud: \nYour light glints of the dry, jagged cave walls. The air grows colder and each step echoes through the silence. Your shadows dance across the stone as the floor slopes further and deeper still. A quiet fifteen minutes pass until you arrive in a large cavern with tall stalagmites rising to the ceiling shrouded in darkness. Your light flickers as a shadow darts by, but it is not one of yours.\nThis is the start of the first monster fight. If the players succeed on a DC 15 Perception check, they spot the first monster before it can attack them, otherwise they will be surprised and the Dark Devourer will attack the player furthest away from a light source.\n2. Fight - The Dark Devourer \nThe Dark Devourer has spawned from the influence of the mirror and is simply a shadow of the original monster. It appears as a moving shadow with glowing red eyes. Outside of the first attack, it will try to attack the player closest to any light source in attempts to snuff out the light. The Dark Devourer will use Shadow Attack at the start of its turn every round. This is a mandatory ability for it. The players should understand from this encounter that fighting in darkness is fatally dangerous.\n3. Defeated Dark Devourer \nWhen the players defeat the Dark Devourer, read the following out loud: \nThe body of the shadowy figure collapses onto the ground as the red in its eyes dissipates. A clattering sound can be heard as a black hand mirror falls out from its torso area. Nearly as soon as the mirror hits the ground, the stone ruptures beneath the corpse, and the body and mirror fall into the fresh gaping hole leading deeper below. \nThe hole is a 5ft square and drops down 30ft before it enters into a small cave. At the bottom of the cave, the body and mirror are nowhere to be seen and there is a narrow passage that leads even deeper. The mirror itself does not reflect anything and is simply a dark void. It is a mirror image of the hand mirror itself and will phase through objects, creatures, and terrain if held too long. Read the following out loud as the party members make their way through the narrow passageway: \nThe air grows colder as you all descend foot by foot, deep into the earth. The rock becomes smoother and the passage begins to open up slightly, enough to stand comfortably, then wider, enough to fight comfortably. And wider still, just enough to fight side by side. And then, an acrid smell hits your noses. The smell of chemicals and rotting flesh.\nIf the party succeeds on a DC 10 Perception check, they will notice that there seems to be small claw marks along the walls and the floor. If the party succeeds on a DC 15 Investigation check, they will notice that in some parts of walls of the cave, it seems like the stone has been melted away by some sort of corrosive substance. If the party succeeds on a DC 15 Nature check, they will notice that the floor of the cave seems to be made of a different type of rock.\n4. The Silent Spawner and Sick Spawn\nIn the claustrophobic corridor, the party is rushed by a swarm of five Sick Spawn. The Sick Spawn are small ladybug-shaped insects, giving off a very faint green glow. 120ft down the corridor is the Silent Spawner—a shadowy, bloated figure with green, glowing eyes. Each turn, it will create a new Sick Spawn. When a Sick Spawn explodes, the acid will instantly melt the stone in the adjacent tiles, revealing more of the cave to fight in. The floor will also be coated in acid. The acid can be cleared away by contact with water and will steam away without harming the players. When a creature ends their turn on a space coated in acid, they will take 1d6 acid damage. The Sick Spawn may come from behind the party as needed as they climb down from the ceiling.\n5. Defeating the Silent Spawner \nWhen the players defeat the Silent Spawner, read the following out loud: \nThe shadowy figure melts into the ground, revealing another black hand mirror. After a brief pause, the hand mirror follows suit, melting into the ground. The passageway ahead continues deeper and starts to wind askew. The remaining Sick Spawn skitter of up the walls into the darkness above, and soon it is quiet. Silent.\nHeading deeper into the cave, the party will arrive at a large open room with tiered terraces along the side, similar to a large arena. Puddles of water cover the ground and the various terraces. When the players reach the room, read the following out loud: \nThe air grows frigid as you all step into this large chamber. Small puddles of water are scattered about the space. Natural terraces line the room with water trickling down the walls. In the silence and darkness, three pairs of glowing blue eyes appear at the far end of the room atop one of the terraces. Two of the figures leap down to ground level, and their misty shadowy forms begin to reveal equally shadowy weapons: a sword, a dagger, and for the one still in the back, a bow.\n6. Triple Threat \nThe triple threats fight two at a time. On any given round, one of the creatures is immobilized and invulnerable. The one that is invulnerable loses the color in its eyes. This is an important clue for the players to identify which one they can attack. Each round, one of the triple threats will become invulnerable in this order: \nArcher → Aggressor → Assassin \nWhile immobilized and invulnerable, the respective creature will take no damage and also have its turn skipped. When the immobilized creature is attacked, the attack will pass harmlessly through its body. When one of them is defeated, the eyes will exchange between the remaining two, such that they immobilize on alternating turns. When there is only one triple threat left, it will immediately gain the blue eyes and never become immobilized.\n7. Defeating the Triple Threat\nAfter all three of the triple threats are slain, read the following out loud: \nAs the final shadowy figure falls, you watch as the shadow dissolves into the ground, its eyes still glowing as they settle onto the ground. The spot where the shadow falls grows dark, seemingly pulling in the darkness from the surrounding cave. The eyes begin to swirl and the dark spot spins like a whirlpool. \nBeckoning. Challenging. The whirlpool is a portal to a mirror dimension where the mirror exists. When the party enters the portal, read the following out loud: \nAs you step into the whirlpool, you are overwhelmed with vertigo as the world around you begins to swirl. Without warning, you are standing in the cave again, with terraced rock, dry ground, and a faint tapping echoing in the darkness.\nAs the party arrives through the portal, the tapping sound will intensify into the sound of footsteps. The footsteps sound like they are coming from far away through the far wall as if it did not exist. The battlefield is identical to the previous one for battle 3, but now seemingly devoid of water, and everything takes on a slightly more monochrome hue. A shadowy figure will walk through the wall to appear before the party, this one with blue eyes and what appears like four arms. It is wielding a bow in two of them, and a short sword and a golden hand mirror in the other two. Adjacent to the party, there are two more shadows that arise from the ground, one with red eyes and one with green eyes. This is the final boss fight.\nFinal Boss Fight - Reflected Revenants\nThis boss fight incorporates the mechanics from the previous fights for a comprehensive final battle. During this fight, the Crimson Carver will take advantage of the darkness to dominate the battlefield. The Jade Jackal will spawn darkness to control the battlefield. The Gold Guard will primarily use ranged attacks to support the battlefield. The spawn from the Jade Jackal will create magical areas of darkness, unlike the Silent Spawner’s acid. Unlike the previous fight, only one creature will be vulnerable to damage at any given time. The blue eyes will move between the three of them in the following order: \nGold Guard → Jade Jackal → Crimson Carver\nWhen the creatures do not have the blue eyes, they will not take any damage, however they are still able to move and take actions as normal. Attacks against these creatures will pass through their shadowy bodies harmlessly. When one of them is defeated, the eyes will exchange between the remaining two, such that one always has the blue eyes. As soon as only one creature is left, they will inherit the blue eyes and become vulnerable to damage. If the Gold Guard is slain while either of the other two creatures are still alive, the mirror will fall into a nearby shadow and appear in the possession of either the Jade Jackal or the Crimson Carver. This will happen again until the mirror is in the possession of the last remaining creature.\nWhen the final enemy is defeated, all the Jade Jackal Spawn and darkness will dissipate and you can read the following aloud:\nAs the last creature collapses, the golden hand mirror clatters to the ground and the world around you shimmers and shatters. You are all returned to the familiar damp cave. It feels brighter than before.\nEnd"},"Adventures/Unit-BH-IgnisΩ5-K.I.A":{"title":"Unit BH-IgnisΩ5 K.I.A","links":["Bounty-Processing-Unit","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Regions/Upper-South-Booftown","Regions/Nevercough-Island","Unit-BH-IgnisΩ5","Combat-Training-Facility","Tomiir-Greatfall","Misc/Arcanite","Regions/The-Outback","Casha-Sang","Bralma-Firehand","Drudak-Emberbrew","POI's/The-Molten-Note","Thynar-Moltensteel","The-Ashen-Leaf","Misc/Alcohol","The-Brew-Master's-Flask","Regions/Mount-Zooka","Factions/Nevercough-Tribunal","Misc/Arcannabis","Flaming-Zombies","Erin-Shortaxe","Stickyickistan","Lower-South-Booftown","Misc/Fist","Flamelock","Face-of-Flames"],"tags":[],"content":"Found on the Bounty Processing Unit\nBPU Info\n\nClient: Internal / Ashen Shadow Society\nLocation: Upper South Booftown &amp; Nevercough Island\nBrief: Recently your peers in Unit BH-IgnisΩ5 were slain by some unknown entity. Our field tech’s were able to preserve the crime scene, and accurately recreate it in the magitech Combat Training Facility. We implore every squad to run a simulation of the crime scene to try and find any info that would lead to the capture or elimination of whoever, or whatever caused the deaths of your colleagues.\nReward: 3,500gp, and a large renown boost within the guild\n\nThe Case: A Debt Ignited\nThe murder involves Tomiir Greatfall, a down-on-his-luck dwarven gambler who owes money to members of a powerful bounty hunting guild, The Ashen Shadow Society. Tomiir recently came into a streak of extraordinary gambling luck after discovering an ancient Arcanite flask in some ruins in The Outback. The flask held a bound Efreeti, Casha Sang, who promised him power in exchange for freedom. Desperate, Tomiir made a wish to become an unbeatable gambler.\nKey Characters\nTomiir Greatfall\nA stocky, nervous dwarf with braided black hair. Once a proud soldier, his life fell apart after a losing streak in the city’s back-alley gambling dens.\nCasha Sang\nAn Efreeti trapped in a magical flask. She is charming, manipulative, and vengeful, with a fiery temper. In her weakened state, she takes on the appearance of a beautiful woman in a flowing red dress.\nBralma Firehand\nThe brutal dwarven leader of Unit BH-IgnisΩ5. She planned to make an example of Tomiir but instead became the victim of Casha’s fiery wrath.\nDrudak Emberbrew\nAn orc bartender and owner of The Molten Note, a smoky tavern where Tomiir frequently gambles and Casha sings.\nThynar Moltensteel\nA corrupt guard on Bralma’s payroll, stationed near the scene of the crime.\nThe Murder\nThe players are hired to investigate the gruesome deaths of Bralma Firehand and her squad in an alley behind The Ashen Leaf, an old boarded up, and foreclosed tobacco shop. Witnesses report hearing screams and seeing a figure flee, while others speak of strange magical flames lingering in the air.\nThe Flask and the Temple\nThe mysterious magical flask leads to an ancient extraplanar temple created by Casha Sang after she altered the flask’s magic. Here, Casha Sang’s power resides in an altar to herself. \nThe flask’s original wondrous nature was a magical Alcohol brewery, and cellar called The Brew Master’s Flask. This flask was buried deep beneath Mount Zooka long ago by the Nevercough Tribunal since its alcoholic nature was strictly against their agenda of an Arcannabis based economy. It was eventually discovered by Casha Sang, and altered to fit her needs as a fire elemental.\nThe players must discover the connection between Tomiir, the murders, and the flask while navigating the dangers of both the urban underworld and the temple’s fiery traps. Th flask returns to its original nature when Casha Sang is defeated.\n1. The Crime Scene\nA guard of the Nevercough Tribunal that was stationed nearby was the first on the scene. Luckily this was a specific guard who has close ties to this case. This guard’s name is Thynar Moltensteel. He was apparently getting paid off by the deceased to look the other way when she went about her business of loan sharking in the area.\nThynar contacted us before he contacted his superiors, so we could send some info techs to quickly scan the crime scene with (REDACTED) before his colleagues arrived. Our info techs weren’t able to investigate the scene, but Thynar gave us his testimony of what he saw, and heard. He heard screaming and a brief, but intense struggle. As he hoofed it towards the commotion, he saw a hooded dwarf with a braided beard running away from the bodies, and duck into a side street.\nThynar chased after the figure, but was unable to catch another glimpse. Our scan of the scene allows us to recreate it in the Combat Training Facility. I will warn you as well that Thynar, and our info techs were attacked by the deceased after they reportedly “reanimated in flames”. You guys will be sent into the simulation, and investigate the scene for any clues on the bodies.\nWe are assuming the bodies will reanimate in the simulation as well, so do your investigations quickly, and maybe you can get out of the simulation before they presumably attack. Like right now. This is absolutely unacceptable. Whoever, or whatever did this must be identified and slain immediately as far as I am concerned. Vengeance is top priority for the guild. We will be paying you for the service. Show them who they are messing with.\nIn the simulator they are sent to the scene of the crime. A soot-stained alley in Upper South Booftown. Burned bodies lie among melted cobblestones, while Everbright lanterns flicker in the thick ash-filled air. Clues include singed weapons (no DC), gold coins (DC 8), and a matchbook from The Molten Note tavern (DC 13). If the gold coins are found, an additional DC 10 investigation reveals that one of the coins is actually a gambling chip from The Molten Note. If the party prioritizes haste, and doesn’t fail two or more rolls, do not attack with the Flaming Zombies. Attack them for failed rolls and lollygagging.\n2. The Molten Note\nA bustling, dimly lit gambling den and music hall. Players can question patrons, gamble with Tomiir’s friend Erin Shortaxe, or watch Casha Sang perform. The atmosphere is a mix of smoke, neon glows, and the clinking of enchanted dice.\nDrudak (The Barkeep)\nThe orc behind the bar is Drudak. He is happy to talk to them and tell them what he knows as long as they are paying for drinks. He can tell them:\n\nA patron fitting the description given by the witness frequents the tavern, a man named Tomiir Greatfall\nTomiir is a heavy drinker and gambler. He doesn’t work so he spends most of his time either at home or here in The Molten Note\nTomiir is bad at gambling, despite his obsession with it. His luck seems to have turned recently, however\nTomiir is a veteran of the Nevercough Tribunal military but doesn’t like to talk about it. Drudak reckons his deployment is why Tomiir is so partial to drinking and gambling. He respects that Tomiir, represented Stickyickistan is battle abroad, so he has never had the heart to ban him\nTomiir is good friends with Erin Shortaxe, another frequent patron of the bar (Points her out at a dice table)\nTomiir isn’t very social and doesn’t speak with many others when not at the table. However Drudak has seen him pestering Casha Sang, the new singer, here after her show a couple of times\nTomiir lives deep in Lower South Booftown at 112 Bakers Close. He once had to take Tomiir home after he’d gotten particularly zooked at the bar\n\nErin Shortaxe\nErin will ask the party to play a game with her if they want to talk. She will be hesitant to say anything too spicy inside the tavern. Erin has 200gp for gambling at the table. Erin can tell the players everything that Drudak can in addition to the following:\n\nTomiir has been uncharacteristically lucky at the gambling tables lately. He’s even been banned from a few gambling halls because they think he’s cheating\nTomiir is clearly infatuated with Casha Sang, the new singer here in The Molten Note. He insists on speaking with her after every show\n(Secret) She knows Tomiir is deep in debt to Bralma Firehand and that she and her squad were coming around asking about him, clearly intending to collect. However she is reluctant to give away this information and requires a DC 12 Charisma (Persuasion) check to convince her to talk\n(Secret) She’s worried that Tomiir has done something stupid. They were talking about Tomiir’s debt problems a couple of weeks ago when Erin joked that he could raid some ruins in the Outback for relics to sell. Since then Tomiir has been acting strangely but is dismissive when asked about it. She’s also reluctant to admit her involvement here in case she’s somehow implicated. A DC 15 Charisma (Persuasion) check is required to convince her to talk about this\n\nGambling\nThey will play a dice version of Texas hold ‘em poker called Fist. A big and small blind will be identified by using d20 rolls. Highest in roll is small blind, and the next highest is big blind. Blind price won’t scale throughout for simplicity sake. Minimum buy in is 50gp, maximum is 500gp. SB pays 1gp, and BB pays 2gp to start the pot, then everyone rolls 2d6 to themselves (and GM). Based on these rolls the players can take the normal poker actions of call, raise, fold. After all pre-flop actions are taken the house dealer rolls the 3d6 flop, and the game progresses as a normal poker game would with players connecting a 5d6 “hand” with their 2d6 and the board. Hands are as follows from highest to lowest:\n\nFive-of-a-kind\nFour-of-a-kind\nFull House\nStraight\nThree-of-a-kind\nTwo-pair\nPair\n\n3. Tomiir’s Shack\nYou emerge back onto the narrow streets and head back into Booftown. As you travel the buildings around you grow smaller, more cramped and more derelict. The stone buildings give way to simpler cookie cutter trailer-like homes, some falling to disrepair. Eventually you reach Bakers Close, a large collection of small, rickety buildings, clearly no more than a room or two each. It doesn’t take long to find number 112, a small building, little more than a hut, with no windows.\nThe door to Tomiir’s House is locked, requiring a DC 12 Dexterity (Thieves’ Tools) check to open, though it is also quite flimsy and can be broken open with a DC 10 Strength (Athletics) check.\nWhen the players enter: You enter into a small abode consisting of a single room and you are immediately hit with the smell of stale sweat, and sulfur. The room is simple with no decoration and few furnishings. On one side there is a small wooden bed, beside which is a bedside cabinet. On the other side of the room is a chest of drawers next to a full-size vanity dresser with a free-standing mirror in a dark wooden frame, ornately carved with depictions of flames.\nInside the cabinet is a half-empty bottle of moonshine and a journal. The final entries in the journal read:\n\n\nTwo weeks ago: Firehand is pissed. If I don’t get her money soon I’m done for. Erin says there are treasures deep in the ground under the city. Maybe I’ll find something?\n\n\nOne week ago: Meeting Casha is the best thing that has ever happened to me. I don’t understand what she did but gambling is so easy now. I’ll have the money back in no time.\n\n\nYesterday: Got the cash. Going to meet Firehand tomorrow.\n\n\nThe chest of drawers mostly contain old clothes, however one contains a pair of Winged Boots and a Potion of Healing that Casha gifted Tomiir. Tomiir wasn’t particularly interested in either.\nOn top of the drawers there is a very old looking normal sized flask. If inspected, the party will immediately notice that a runic script has been carved into the flask ad-hoc clearly exposing shiny metal beneath the weathered exterior of the flask. Also engraved on the bottom in common in text that looks just as weathered as the rest of the flask is a riddle.\n“Fill me up and let me flow to the floor\nFrom above thy head to thy toe opens a door”\nThe key to opening the doorway into the flask is to use the bottle of whiskey found in the bedside table. When poured from above the head of the holder, the alcohol flowing from the flask forms a gateway into the flask’s inside. Any alcohol will work. The flask then floats in mid air with the gate open. Since the flask is currently being used by Casha Sang as her elemental temple of fire power, the runic inscription will glow orange when the gate is opening and the edges of the gate catch on fire. Casha has compromised the security of the flask with her magical alteration of the artifact. Her tampering made it so the gate can be opened by someone who is not attuned to the item, and multiple creatures can cross the threshold to the inside of the flask Players entering the flaming gateway must succeed a DC 12 DEX saving throw or take 1d6 fire damage. Casha, however, is the only one who can close the gate.\nIf they take too long to solve the puzzle: The door abruptly opens and you see a woman standing in the doorway. She wears an elegant ruby-red evening dress, has fiery red hair which curls down her back, and smokes through a cigarette holder. You recognize her as the singer from The Molten Note. She exhales smoke and asks: “I suppose you are trying to find Tomiir?”\nCasha Sang enters the room and deflects any questions they throw her way. She knows Tomiir is in her temple and wishes to protect him. Knowing that the players will ultimately figure out how to work the flask, she is merely trying to stall them so she can get there first. If they attack her, she immediately reduces to ashes which open the flask gate, and then she will fly towards the gate and into it. \nIf they do not attack her, then: She approaches the flask and grabs the bottle of whiskey as if to prepare a drink, fills the flask, holds it above her head, and begins pouring it out onto the floor. The whiskey falls to the floor, but as it reaches the floor you see it start to flow back up to the flask, making an oval shaped ring of whiskey in the air. The runic inscription on the flask glows orange and the whiskey ring catches fire, revealing another room through the whiskey ring and the strong scent of sulfur. She turns towards you and smiles, then clicks her fingers. Immediately you are blinded by a flash of light, and as your vision returns the room around you has changed dramatically. The door, flask and other items in the room are gone. As is the floor. Instead you each stand upon a tiny platform above a 50 foot drop into lava. You can hear the sizzle and feel the intense heat coming from below. The walls of the room are severely scorched.\nThe changes to the room are an illusion created by the spell Major Image. If the players test the illusion in any way, they will find the floor is still there, as are the other contents of the room. Once they have confirmed it is an illusion, it fades. The entrance through the gate remains open.\n4. The Temple of Ash and Flame\nUpon entering Casha’s shrine, they step onto a platform that appears to be above a 50 ft. drop straight into lava below. They can feel the heat and hear the sizzle of the molten lava below them, and the room smells very strongly of sulfur. The changes to the room are an illusion created by the spell Major Image. If the players test the illusion in any way, they will find the floor is still there, as are the other contents of the room. Once they have confirmed it is an illusion, it fades. The entrance through the gate remains open. \nStepping through the gate you find yourself in a small, dark chamber with mosaic tiled walls and a cracked marble floor. The mosaic tiles depict strange angular patterns in black against a white background, though some tiles have come loose. A staircase leads downwards towards a door made of dark marble. The strong scent of sulfur hangs in the air.\nIf the players listen at the door, a DC 10 Wisdom (perception) check is required to hear the faint sound of sobbing from the other side. \nWhen they open the door: You open the door into a large chamber. As before the walls are mosaiced with most displaying similar black angular patterns on a white background. The far wall however has a colorful depiction of a woman silhouetted in flames as a forest burns around her. In the center of the room is an altar, atop which is a stone carving of a woman. Resting on the altar is an unstoppered ceramic flask. Two alcoves on each of the side walls contain lit braziers which illuminate the room. Kneeling with his back to the altar and facing the doorway is an unusually tall dwarf with long black hair pulled into three large braids and a short beard split into two small braids.\nThe kneeling dwarf is Tomiir Greatfall, who hid here in a panic after the murder.\nIf the players solved the mirror puzzle before Casha arrived then Tomiir is alone. When he sees the players: He looks up trembling. “Please, it’s not what it seems. It wasn’t me. It was… her. I thought she was going to help me, but instead she ruined everything. And she’s coming for me, I know she’s coming!” \nIf the players ask him what happened he’ll do his best to explain, but he’s flustered and is struggling to make himself understood. He starts to tell them:\n\nHe was in trouble and needed money fast\nDesperate, he went looking for treasure in the Outback\nHe found a flask, and this place, and he released “her”\n\nBefore he can explain more than this, Casha Sang enters: You see fear cross the dwarfs eyes as he looks past you. You turn and see a woman coming down the stairs. She wears an elegant, ruby-red evening dress, has fiery red hair which curls down her back and smokes through a cigarette holder. You recognise her as the singer from The Grooved Axe. She slowly exhales smoke and says “Now Tomiir, I hope you aren’t speaking ill of me, are you?”\nIf the players failed to solve the mirror puzzle before Casha arrived then she is already here. When they first enter: He looks up, trembling. “Please, it’s not what it seems. It wasn’t me. It was… her.” The woman in red emerges from behind the altar and walks towards him. “Quiet now, you know it was for your protection.” Regardless of whether the players solved the mirror puzzle, Casha will humor them and answer a few questions. She can reveal:\n\nThat she has helped Tomiir and in exchange he has been helping her. They need each other\nThat fool Firehand wanted more than just repayment for Tomiir’s debt, she also wanted to take one of his fingers. Casha couldn’t allow her to harm Tomiir \n\nAfter a short time: The woman begins to look impatient. “I think this is enough conversation. You all now know too much… regretfully, I must now deal with you”. She waves a hand and in an instant she burns away to ash, ash that floats through the air towards Tomiir. He panics, scuttling away from it but with a scream is consumed by it and erupts into flames. The ash recedes and you see Tomiir, now burned to a skeleton, stand up. He holds his skeletal hands out in front of him and each erupts into flames. The remainder of the woman’s ash forms into a ghostly visage of her face, her hair flowing above like flames. She floats in the air behind “Tomiir”.\nCasha has taken control of Tomiir, turning him into a Flamelock (with mage armor). She has also exerted herself as far as she is capable so she can utilize a small portion of the power she used to wield, in the form of a Face of Flames. Both of them attack the players. During the fight if Casha is reduced to 0 HP she disintegrates once again to ash which flies into the altar. On her next turn the ash pours from the lamp and her face of flames form is recreated with half health. If the altar is destroyed while she is inside it, or she is reduced to 0 HP after the altar has been destroyed then she dies permanently. The altar has an AC of 10 and 8 HP. Once she is defeated all creatures are forced out of the flask as it returns to its original wondrous state as The Brew Master’s Flask. It will be on the ground beneath where it was floating while the gate was open. The sigils that were carved into the front face are now gone. If the gate is opened it now leads to the magical Alcohol cellar.\n If during the fight Tomiir is reduced to 15 HP or below, he will fight against Casha’s control and gasp “The altar! It must be destroyed…” before once again losing himself to her. If Tomiir still lives when Casha is permanently killed he will revert back to his original form, alive. With his binding to Casha severed, he can now tell them everything that happened."},"Deities/Kuutar":{"title":"Kuutar","links":["Deities/The-Three-Sisters/The-Three-Sisters"],"tags":[],"content":"Kuutar, the Moon Weaver\nPantheon: Finnish (Incorporated into D&amp;D settings)\nAlignment: Neutral Good\nDomains: Moon, Night, Dreams, Fate\nSymbol: A silver crescent moon with woven threads of starlight\nLore &amp; Worship\nKuutar, the radiant Moon Weaver, is a goddess of the night sky, dreams, and fate. She is a celestial spinner, weaving silver threads of moonlight into the tapestry of destiny. Her light gently guides lost travelers, soothes restless souls, and illuminates the paths of those seeking wisdom in the quiet of night.\nIn some traditions, Kuutar is seen as a sister or counterpart to Päivätär, the goddess of the sun. While Päivätär brings warmth and prosperity, Kuutar grants visions, intuition, and protection under the cover of darkness. Some scholars of the arcane believe she holds sway over prophetic dreams and the hidden knowledge found in the stars.\nHer followers include seers, bards, nocturnal wanderers, and those who find solace under the moon’s glow. Many elves, fey, and druids invoke her name when seeking guidance through omens or celestial movements. Worship often involves moonlit rituals, offerings of silver, and intricate woven tapestries representing the night sky.\nTenets of Kuutar\n\nEmbrace the Night’s Wisdom: Truths are often revealed in the quiet of night—seek them in dreams, starlight, and the unseen.\nWeave Fate with Grace: Every soul has a thread in the great tapestry; do not sever another’s unless it is truly their time.\nShine in the Darkness: Be a guiding light for the lost, a whisper of comfort in sorrow, and a beacon against despair.\n\nManifestations &amp; Servants\nKuutar is said to manifest as a veiled woman clad in silver and blue, with flowing ribbons of moonlight trailing from her hands. Her voice is soft as a lullaby, and her eyes reflect the entire night sky. Her divine emissaries include moon moths, silver-furred wolves, and spectral owls that guide seekers to hidden truths.\nIn some myths, Kuutar is also a weaver of celestial fate, her loom spun from strands of moonlight and shadow. It is believed that when the moon is full, she completes a great design that influences destiny—sometimes as a blessing, sometimes as a warning.\nKuutar &amp; The Three Sisters: A Dance of Moon and Fate\nKuutar, the Moon Weaver, shares a deep yet enigmatic relationship with The Three Sisters, the goddesses of fate who spin, measure, and cut the threads of destiny. While the Sisters dictate the fates of mortals and gods alike, Kuutar is said to weave moonlight into their work, illuminating the unseen paths and subtle choices that shape a soul’s journey.\nA Balance of Influence\nThe Three Sisters—spinners of fate—are impartial and inexorable, their hands weaving the fabric of existence with an unyielding precision. Kuutar, though she respects their craft, offers a counterbalance to their rigid decree. Some myths say that she whispers to the strands of fate as they are spun, softening the harshest dooms and revealing hidden alternatives to those who seek them under the moon’s glow.\nIn turn, the Three Sisters tolerate Kuutar’s influence because they recognize the necessity of choice within destiny. They do not undo their own work for her, but they allow her subtle hand to guide mortals toward paths they may not have seen otherwise. When the moon is full, it is said that the Sisters listen to Kuutar’s counsel, granting brief moments where fate may be rewritten.\nRivalry or Partnership?\nThe nature of Kuutar’s relationship with the Sisters is debated among scholars and oracles. Some see it as a quiet rebellion against the inevitability of fate, while others view it as a necessary partnership—where fate weaves the world, and Kuutar ensures its beauty and purpose.\nOne legend tells of a mortal hero whose thread the Sisters had cut too soon. Kuutar, moved by their courage, stole a silver thread from her own loom and intertwined it with the mortal’s severed fate. This act enraged the Sisters, who do not abide interference, but instead of punishing Kuutar, they challenged her to a wager. If the hero could prove their worth beneath the next three moons, their fate would remain altered. Under Kuutar’s light, the hero triumphed, and thus the Three Sisters begrudgingly allowed the change.\nSince that day, those who wish to challenge fate pray under the full moon, hoping for Kuutar’s quiet intervention. Whether she grants their wish is unknown, for even the Moon Weaver must respect the will of the Sisters—or risk having her own thread severed."},"Deities/The-Three-Sisters/Ashalla":{"title":"Ashalla","links":["Species/Halflings","Regions/Upper-South-Booftown"],"tags":[],"content":"The Green Goddess\nAshalla represents bounty, family, and community, and she is the most widely worshiped among Halflings farmers and healers. Her followers tend to crops, animals, and kin, believing that nurturing and protection are the greatest virtues. Even among the urban halflings of Upper South Booftown, small shrines to Ashalla can be found in homes, praying for safety and prosperity. However, not all of her followers are passive—some believe that nature’s bounty must be fiercely defended, and they will fight to protect their homes and kin against exploiters and invaders."},"Deities/The-Three-Sisters/Darana":{"title":"Darana","links":["Species/Halflings","Stickyickistan","Misc/Arcannabis"],"tags":[],"content":"The Blue Goddess\nDarana is the patron of those who embrace the impartiality of nature. Halflings druids, scouts, and alchemists who see balance as the ultimate law often follow her teachings. Water, a symbol of her neutrality, is particularly revered among halflings who navigate Stickyickistan’s jungle rivers and coastal trade routes. Many Arcannabis cultivators also honor Darana, believing that balance in nature leads to the most potent harvests."},"Deities/The-Three-Sisters/Shadash":{"title":"Shadash","links":["Species/Halflings"],"tags":[],"content":"The White Goddess\nShadash is the darker aspect of nature—pestilence, destruction, and decay—and is feared as much as she is revered. Among the Halflings poison-makers, assassins, and outcasts, Shadash’s name is whispered in respect. They see her as a force of necessary destruction, removing the weak so the strong may thrive. Some extreme followers even experiment with toxic alchemy and curses, believing that spreading death is part of maintaining balance."},"Deities/The-Three-Sisters/The-Three-Sisters":{"title":"The Three Sisters","links":["Deities/The-Three-Sisters/Ashalla","Deities/The-Three-Sisters/Darana","Deities/The-Three-Sisters/Shadash","Factions/Verdanfey","Lord-Durakor","Factions/Ashenfey"],"tags":[],"content":"While nature lies in the middle of order and chaos, it has three faces: good, evil, and neutral. These three faces are personified by the Three Sisters, the primary goddesses of nature in pre-colonization Stickyickistan. They are Ashalla, Darana, and Shadash. Ashalla, the Green Goddess, is the personification of the good aspects of nature. Her symbol is a sheaf of wheat, representing the bountiful and nurturing aspects of nature. She is regarded as the provider of food, sunshine, pleasant weather, and other good natural things. She is also the protector of parents and children. Druids and clerics who worship her serve to aid their communities by healing the wounded, curing the sick and helping crops and animals flourish. While her followers are sometimes stereotyped as peaceful huggers of trees, among their number are far more militant followers who take up arms and magic to defend what is good. Ashalla has strong connections with positive energy, and she is the kindly ruler of the Verdanfey—a fey dimension infused with this power. Darana, the Blue Goddess, is the personification of the balanced and neutral aspects of nature. These are the aspects that bring both weal and woe without discrimination. Her symbol consists of a series of idealized waves, for water is a paradigm of nature’s neutrality. Water gives life, but also takes it away. Water that once quenched a child’s thirst can become part of a flood that destroys a city and drowns that same child. Priests and druids who respect the impartiality of nature worship her. Like her, they seek to maintain a balance and to ensure that the course of nature is not distorted by good or evil. Her more militant followers abide by the saying that nature is cruel but fair. Darana often visits the Feywild and considers it her second home. Shadash, the White Goddess, is the personification of the brutal and destructive aspects of nature. Her symbol among humans and elves is a white rose with thorns dripping blood. Among the more brutal humanoids her symbol consists of bloodied claws. Shadash is the bringer of death, pestilence, and destruction. Priests and druids who regard the furthering of death, destruction and decay as desirable serve her. Like her, they desire to maintain the balance of nature through negative forces: life must be countered by death, health by disease, growth by destruction. While Shadash always has a strong connection to negative energy, in some realities she becomes corrupted by the undead demon Lord Durakor leading to the creation of Nature’s Undead and granting her druids power over those undead. Shadash maintains the Ashenfey—a fey dimension accursed with negative energy. Here she is known as the Lady of Ashes. Her followers abide by the saying that nature is cruel but fair. But mostly cruel."},"Encounters/Abandoned-Castle-Ruins":{"title":"Abandoned Castle Ruins","links":["tags/Red","tags/Purple","NPC's/Velindra-Ashveil","Grim-Forest","Regions/The-Outback","Human-Colonialism","Species/Halflings","Deities/The-Three-Sisters/Shadash","Acolytes-of-Shadash"],"tags":["Red","Purple"],"content":"Red Purple\nThis encounter can be initiated in a few ways. Velindra Ashveil can give them information about this location for 100gp, alternatively they may come across it while travelling in the Grim Forest through The Outback. Just off the main road through the Grim Forest is a hidden path that can be seen with a DC 16 Perception check. This path leads to the ruins of an abandoned castle from before Human Colonialism. These ruins are now inhabited by a cult of Halflings that worship Shadash (Acolytes of Shadash). They believe they have a spiritual connection to the castle, and their ancestors who they claim once inhabited it. If the PC’s inspect the castle walls, there are verses etched into the stone walls above doorways, and an altar that clearly show those who built the castle venerated Shadash. A DC 13 Religion check will allow the PC more info about Shadash if they know nothing. The acolytes do not take kindly to outsiders especially if they aren’t Halflings, and will not hesitate to strike. There are six acolytes at the castle, and they are using the basement of the castle to store:\n\n133gp\n2 rubies worth ~25gp\n1 diamond worth ~100gp\n278sp\n507cp\nand a bunch of handmade jewelry adorning symbols of Shadash worth ~0.\n\nThe acolytes can be reasoned with, and just want to be left alone to rebuild the castle, but they do plan on spreading death and decay in the surrounding area."},"Encounters/Giant-Centipede-Hunt":{"title":"Giant Centipede Hunt","links":["tags/Red","NPC's/Kezrin-Malvek","Factions/The-Plague-Plugz","Regions/The-Outback"],"tags":["Red"],"content":"Red\nThis encounter can be initiated in a few ways. The PC’s could be accompanying Kezrin Malvek on his task to collect Giant Centipede venom for The Plague Plugz, or the PC’s may have been asked to do the same task by them. Either way they will have to go into The Outback and find some Giant Centipedes. If they have Kezrin with them, he already knows where a bunch are. If they go by themselves, at least one PC must succeed a DC 13 Nature, or Survival check to track down some Giant Centipedes. They will end up in a clearing of the woods surrounded by high terraced stone walls. Here there are about 8 Giant Centipedes. They know that The Plague Plugz will buy a vial of venom for 100gp, or Kezrin asks them to help him fill 3 vials. To collect venom from a Giant Centipede, you need access to it’s fangs, and it must be unable to attack, whether it is dead, grappled, stunned, etc. Kezrin can show them how to properly extract the venom from the fangs of a giant insect (this will also work on Giant Spiders and the like), or they can try to Succeed a DC 14 Nature check to flex the creatures mandibles while holding a vial beneath its fang. Each creature has enough venom to fill one vial. If the creature is not dead, it will regenerate the venom naturally in an hour."},"Factions/Ashen-Shadow-Society/Ashen-Shadow-Society":{"title":"Ashen Shadow Society","links":["The-Legion-of-Steel","Sources/Dragonlance","Stickyickistan","Regions/Nevercough-Island","NPC's/Zara-Blackthorn"],"tags":[],"content":"A replacement for The Legion of Steel from Dragonlance.\nHistory\nThe Ashen Shadow Society is a bounty hunting guild in the realm of Stickyickistan, headquartered in the bustling downtown district on Nevercough Island. The guild was born years ago in the shadowy underbelly of the city, starting as a loose network of ex-military operatives, hired swords, and wands for hire. From these humble beginnings, they quickly realized the immense profit to be made in the arcane chaos of Stickyickistan and its surroundings.\nWith the arrival of foreign settlers and merchants, Stickyickistan experienced unparalleled economic prosperity but also some of the most glaring economic inequalities in the multiverse. In the city’s early days, blue-collar crime ran rampant, and law enforcement struggled to keep up. The Ashen Shadow Society initially thrived by targeting those criminals that the authorities couldn’t catch, earning a reputation as effective enforcers of the law—for a price. Over time, however, their operations expanded significantly as the guild capitalized on the rapid development of Stickyickistanian magitechnology.\nAs magitechnology advanced, so too did organized crime. White-collar crime syndicates emerged, rivaling the traditional blue-collar offenses. This evolution created even more lucrative opportunities for the guild, enabling them to upgrade their facilities, weapons, and equipment. With these advancements, the Ashen Shadow Society began taking on increasingly high-profile and high-stakes contracts, eventually reaching the formidable level of influence they wield today.\nNow, the Ashen Shadow Society operates as a powerful, semi-independent entity that often acts outside the bounds of the law. Though they once worked closely with law enforcement, they now follow their own rules, driven by profit above all else. Membership in the guild is highly exclusive, and only the most skilled and disciplined individuals are granted full status. Those who fail to meet their standards or fall out of favor are relegated to the “Support Squads”—a derisive term for teams assigned the most dangerous and thankless tasks, often serving as expendable assets for the higher-ranking members.\nThe guild’s primary goal has always been, and remains, the pursuit of wealth. “Money” to the Ashen Shadow Society isn’t just gold; it can also mean powerful magical items, influence, or eliminating obstacles to their profit margins. While they do not kill indiscriminately, they are mercenaries in the truest sense, willing to take any job—so long as the price is right. True to their chaotic neutral alignment, they are a dangerous and unpredictable force in Stickyickistan, a group guided by ambition and the allure of gold.\nHierarchy\nWithin the clandestine world of the Ashen Shadow Society, a complex hierarchy governs the inner workings of the organization. Divided into squads and driven by internal competition, this system ensures power dynamics and control within the elite bounty hunter clan. Here is an overview of the hierarchy, where groups of four hold significant influence:\nThe Council of Shadows:\nAt the pinnacle of power lies the Council of Shadows, composed of four highly influential figures within the Ashen Shadow Society. These individuals are the true leaders, pulling the strings from the shadows and determining the clan’s overarching objectives. Their identities remain closely guarded secrets known by the Enigmatic Quartet, including Zara Blackthorn. The Council wields immense authority, making decisions that shape the destiny of the organization.\nThe Enigmatic Quartet:\nDirectly beneath the Council of Shadows is the Enigmatic Quartet, a group of four renowned and enigmatic assassins who serve as the council’s primary advisors. Each member possesses distinct skills and expertise, representing different facets of the clan’s operations. The Enigmatic Quartet holds significant sway within the Ashen Shadow Society, their influence extending to strategic decision-making, resource allocation, and the execution of critical missions. They are known for their elusive nature, rarely seen in public and shrouded in mystery.\nThe Squad Hierarchy:\nWithin the Ashen Shadow Society, squads of bounty hunters form the backbone of the organization. These squads consist of four highly skilled individuals who work together to complete missions and bring in lucrative bounties. Each squad operates with its own internal hierarchy, determined by the squad members themselves. The more money a squad brings in, the higher their status and privileges within the Ashen Shadow Society.\nSquad Ranks:\na) Novices:\nNovices are newly formed squads within the Ashen Shadow Society. They are comprised of bounty hunters who have recently joined forces and are still establishing their reputation. Novice squads are eager to prove themselves and climb the ranks of the organization. They undertake smaller missions and lower-paying bounties as they build their experience and teamwork.\nb) Bloodhounds:\nBloodhound squads have proven their mettle by successfully completing several mid-level missions and consistently bringing in substantial amounts of money. Their exceptional tracking skills and resourcefulness make them formidable adversaries. As Bloodhounds, these squads gain more recognition within the organization, earning access to higher-paying and more challenging contracts.\nc) Ravens:\nRaven squads have established themselves as elite units within the Ashen Shadow Society. Their expertise, experience, and track record of high-value bounties set them apart from the rest. Ravens excel in both stealth and combat, making them versatile and highly sought after for specialized missions. Their accomplishments grant them respect and influence among their peers.\nd) Shadowsong:\nShadowsong squads are the pinnacle of success within the Ashen Shadow Society. They are legendary in their skill, notoriety, and the wealth they bring in. Shadowsong squads have mastered the art of bounty hunting, their prowess unmatched by any other unit. They operate with precision, efficiency, and lethal effectiveness. Shadowsong squads are entrusted with the most dangerous and lucrative missions, and their successes are celebrated throughout the organization.\nSquad Competition and Rewards:\nSquads within the Ashen Shadow Society compete fiercely to bring in the largest sums of money. The more successful a squad is in completing high-value contracts, the more missions they are entrusted with, leading to greater opportunities for wealth and advancement. A squad’s rank determines their cut of the earnings, allowing higher-ranked squads to enjoy a larger share of the bounty.\nAs squads rise through the ranks, they gain access to better resources, equipment, and support from the organization. They also gain recognition and influence among their peers, solidifying their position within the Ashen Shadow Society.\nIt is through this dynamic hierarchy that squads of bounty hunters strive to ascend and establish their reputation, ultimately aiming to catch the attention of The Enigmatic Quartet and the Council of Shadows, the ultimate arbiters of power within the organization.\nSupport Squad:\nThe support characters are recruits that have shown they don’t have what it takes to be on an actual ASS bounty hunting squad, but they can still be useful. Since they are recruits, they have seen the inside of the citadel, therefore if they don’t survive they can’t tell any tales."},"Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9":{"title":"Unit BH-Umbra Δ9","links":["Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Regions/Bobo-Bush-Estates","NPC's/Hazeus-Tokenheim","Arcannabis-Extraction","Indicus-Sativalin","Regions/Upper-South-Booftown","Weknas-Grasscheeks","Factions/Cough-City-Crew","Cough-City-Thugs","NPC's/Grimjaw","Whisper","Vex","POI's/Ashen-Citadel","NPC's/Zara-Blackthorn","Gilded-Nug","NPC's/Wes-Scantlin","Regions/The-Outback","Player-Characters/Fungi","Regions/Gapejaw-Bog","Player-Characters/Wraith","NPC's/Arcana-Belle","POI's/The-Green-Grimoire","Player-Characters/Baeriggs-Bigbreath","POI's/Puffer's-Pottery","Factions/The-Plague-Plugz","Player-Characters/Xon","Factions/The-Norfies","Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII"],"tags":[],"content":"This is a squad of Ashen Shadow Society Bloodhound rank bounty hunters.\nLore\nArcannabis Colossus\nThis unlikely group of misfits came from humble standing in the guild and society as a whole. As a Novice squad they were sent to Bobo Bush Estates to investigate an abandoned botanical garden that locals said had been taken over by some kind of plant horror. They arrived and exterminated an Arcannabis Colossus to the surprise of the guild who thought it was certain they would die.\nPot Potion Press Pilfer\nAfter that they were hired through the guild by a man named Hazeus Tokenheim to recover an item that had been stolen from his Arcannabis Extraction factory. Hazeus was certain that one of his smaller competitors, Indicus Sativalin, had a hand in stealing the machine, but he couldn’t be sure he acted alone. The squad went to the factory to investigate the scene of the crime. Here they were able to gain some critical info that the heist would have been much too difficult for one man to do alone, but that was all. Next they decided to try and get in contact with an informant through the guilds sources. They headed to Upper South Booftown to meet a shady individual known as Weknas Grasscheeks, a low time member of the Cough City Crew that agreed to snitch on the gang for money. Weknas was waiting for the squad in an empty lot in front of a strip club, and bodega. Before they were able to get any info out of Weknas they were spotted by some Cough City Thugs, and a fight broke out over Weknas’ apparent snitching. The thugs were defeated, and Weknas revealed the involvement of high ranking Cough City Crew members in the heist of the Arcannabis Extraction machine. They were paid by Indicus to steal the machine, and to protect him while he attempted to reverse engineer it and make the schematics public. Weknas’ final word before sprinting away into the dark alleyways, was that the Machine was taken to Indicus’ secret lab in the forgotten sewer system. The squad used this information to find an entrance to the forgotten sewers where they encountered Indicus’ hired security who they swiftly dealt with. Once inside they snuck past more security, and some alchemists in a magitech hydroponics operation. Just past the hydroponics is where Grimjaw, a Cough City Crew member was sitting. They snuck past him too, and into the main alchemy lab where Indicus was speaking with two other high ranking Cough City Crew members named Whisper, and Vex. The squad was able to hide until Whisper and Vex left the room momentarily, then they confronted Indicus by surprise. Indicus desperately tried to explain his motive to the squad. He explained that Hazeus has had an illegal monopoly on the Arcannabis Extraction market for years, and he has been using his immense wealth, and political cronies to manipulate the laws in his favor. He wanted to expose Hazeus’ corruption, and make the extraction machine available to all in Stickyickistan. It was then that Grimjaw, Whisper, and Vex all re-entered the room. Xon was able to recognize Grimjaw from a description and a wanted poster with a 5000gp reward they saw at the Ashen Citadel. Quickly Xon made the executive decision for the squad to abandon the original bounty, take Indicus’ side against Hazeus, and instead claim the bounty on Grimjaw’s head. A fight ensued, and the squad stood victorious. They took Indicus’ word for future work, and chased in the bounty on Grimjaw. When Hazeus got word of the betrayal, he sent a strongly worded letter to Zara Blackthorn threatening to put a bounty on the squad.\nThe Gilded Nug\nAfter spending some of their money from the bounty they did get, they were sent on their most dangerous mission yet. This mission was not about the money, but about a legendary artifact that the guild has been after for years called the Gilded Nug. The guild had already sent a different squad on a mission to steal it from a Cough City Crew member who had it at the time. While they were undercover as Cough City Crew members, they were able to get close to the member in possession of the Gilded Nug, but one fateful night, the trap house they were hiding out in was broken into. An infamously disgraced singer and bard, Wes Scantlin, from a well known rock band of the realm called Puddle of Mudd, came to take the Gilded Nug for his own nefarious purposes. The Gilded Nug was stolen, but the undercover squad was able to follow Wes to his lair in The Outback. They were led to a place known as Gapejaw Bog where they lost sight of Wes. They reported back to Zara who then relayed this info to Unit BH-Umbra Δ9. They set out into the Outback with a poorly drawn map that the undercover squad made for them. On the trail they faced a few tough fights, and ended up losing Fungi in the forest. The rest of the squad carried on with the mission, and eventually made it to Gapejaw Bog where they narrowly avoided Wes’ magical traps, and spectral defenders. Once in the main cavern, they heard the sounds of Puddle of Mudd being played by Wes. He was jamming on his lyre as the squad snuck up on him. As Wraith closed the distance Wes sensed his presence at the last moment, and went invisible. Wes tried to run away while assuming he was unseen, but Wraith’s blindsight ability allowed him to catch Wes and deliver a stunning strike. This proved to be too much for the infamous bard, and he was cut down before getting to fight back, or explain himself. After Wes fell dead, a magical portcullis dissipated behind him to reveal the Gilded Nug in a glass case. the squad retrieved the Nug, exited the cave, and were extracted by Zara Blackthorn on an airship.\nBugs &amp; Bloodhounds\nThey were taken back to the Ashen Citadel where they received their reward for completing the mission, and reunited with Fungi who was infested with bugs. Zara explained their new Bloodhound rank status to them and gave them all an A.S.S Sending Stone. She them recommended that they get Fungi fixed up right away, and gave them the address of a healer by the name of Arcana Belle. Zara also notified the squad that their quarters are being upgraded, so they would be unavailable for a few hours. Finally she also lets them know that because of Fungi’s failure on the last mission, the whole squad would have to complete a combat training exercise before they would be allowed to take on more guild work. The squad left Zara’s office and went downtown to go shopping. On the way to The Green Grimoire, Wraith and Baeriggs Bigbreath were able to spot some thieves can’t on the sign of a pottery shop called Puffer’s Pottery, and the man behind the counter was a bit too hairy. The thieves can’t read “Poison Shop”, so they went in. They discreetly made it apparent they were not there for pottery, and they were instructed to go behind a curtain and down some stairs in pairs of two. In the basement they met a wererat named Rikki Tweeks, and other members of their gang called The Plague Plugz. They bought some poison, and got an offer to collect some Giant Centipede venom for Rikki at a price of 100gp per vial of venom. While walking around downtown, they noticed an odd couple that seemed to be following them. A tall blonde woman in a flower dress with a sigil adorned staff, and a red dragonborn wearing immaculate armor with a sword at his waist. The squad ducked into an alleyway, and Wraith made an illusion of a brick wall behind them. The duo looked into the alley from across the street, and teleported away. Xon saw them one more time as they approached the Ashen Citadel. This time they were much further away, and just standing watching instead of following. When the squad finally returned from their shopping trip they began the combat training exercise.\nMembers\n\nWraith\nXon\nBaeriggs Bigbreath\nFungi\n\nAllies\n\nThe Plague Plugz\nIndicus Sativalin\nWeknas Grasscheeks\nZara Blackthorn\nThe Norfies\n\nEnemies\n\nHazeus Tokenheim\nCough City Crew\nTribunal Highblade Coalition\nDusk Flame VII\n"},"Factions/Ashenfey":{"title":"Ashenfey","links":["Deities/The-Three-Sisters/Shadash","Ashen-Elves"],"tags":[],"content":"Like her sister, Shadash created her own realm. To differentiate it from her sister’s realm, Shadash blended strong threads of negative energy into the weave of the world, thus creating an inherent necrotic taint.\nTo populate her new realm, Shadash coerced neutral and evil fey to join her. She also forcibly transported humanoids, plants, and animals. These transplants faced the harsh challenge of adapting or dying. While many perished, some survived and a few even thrived. A group of elves, the Ashen Elves, created a civilization within the Ashenfey, although this later fell due to treachery and corruption. Most of the realm’s inhabitants are evil, and the others tend to be hard-hearted survivors. Visitors to this realm can expect, at best, cruel indifference.\nThe Ashenfey resembles the natural material world but can be best described as having a profound darkness and harshness. Plants have more and sharper thorns, venom and disease are more intense, colors are more subdued, animals are more savage, the rivers are often sluggish and flow with tainted water, and so on. Because the Ashenfey is infused with negative energy and weak in positive energy, all living creatures in the Ashenfey gain “resistance” to healing and necrotic vulnerability. If a creature is normally vulnerable to necrotic damage, that vulnerability remains. If a creature is normally resistant to necrotic damage, it loses that resistance (but does not gain vulnerability). Creatures normally immune to necrotic damage become resistant while in the Ashenfey. Undead creatures find the negative energy of the Ashenfey pleasant and stimulating. Whenever they make an attack roll or a saving throw, they roll a d4 and add the number rolled to the attack roll or saving throw.\nAn odd feature of the Ashenfey is that it contains no native silver ore; instead, it has necrotic iron. This metal can be worked like iron, though it is somewhat heavier. Necrotic iron brought into the Verdanfey grows uncomfortably warm and emits sparks of shadow. Material plane silver brought to the Ashenfey grows slightly warm and erratically emits faint sparks, as if the realm were trying to reject it. Fey silver brought to the Ashenfey grows uncomfortably hot and emits bright sparks. Many creatures of the Ashenfey find silver to be unpleasant, and to some, it is toxic. Inhabitants of the Ashenfey often refer to the material plane as the “Silverlands,” usually in a derisive manner.\nWhile the Ashenfey is a distinct plane, it is coextensive with parts of the material plane. Because of this, the Ashenfey and material plane resemble each other, though there are significant differences. For example, a healthy material plane river is likely to have an Ashenfey counterpart, but this counterpart is likely to be a smaller river with foul water and a sluggish current. There are numerous weak spots in the barrier between the realms that permit intentional and accidental travel between them. These spots are often important to druids, and some are marked with special trees or rings of standing stones—often to warn the unwary of the danger. The opening of such gateways is often marked with a strange weather event, such as a lightning storm with oddly colored lightning and harsher-than-normal thunder. Certain good beings watch for these signs, standing on guard against what might emerge from the Ashenfey."},"Factions/Cough-City-Crew":{"title":"Cough City Crew","links":[],"tags":[],"content":"Backstory\nIn the bustling city streets of Stickyickistan, a notorious street gang known as the Cough City Crew held sway over the criminal underbelly. The origins of this infamous gang can be traced back to a time when economic disparities and societal inequalities plagued the city-state.\nStickyickistan, with its booming Arcannabis industry and vast wealth, had created a stark contrast between the opulent elite and the struggling lower classes. It was within the marginalized neighborhoods, where poverty and desperation reigned, that the seeds of the Cough City Crew were sown.\nThe gang’s formation can be attributed to four charismatic and street-smart individuals who shared a common bond of hardship and disillusionment. They were known as the “Founding Four,” and their names echoed through the city as whispers of fear and rebellion: Rocco “Ratjaw” Moreno, Maxine “Viper” Diaz, Ezra “Slick” Evans, and Tara “Torch” Sanchez.\nThe Founding Four, each with their unique set of skills, came together with a shared vision—to reclaim power and control over their lives. They witnessed the exploitation and corruption that ran rampant in Stickyickistan and vowed to forge a path of their own, built on loyalty, camaraderie, and the pursuit of a more equitable society.\nThe name “Cough City Crew” emerged from the squalid conditions of the gang’s early days. The neighborhoods they called home were known for their suffocating pollution and smog, which perpetually lingered in the air, causing bouts of coughing among its residents. It was in these polluted streets that the crew found strength, resilience, and their determination to rise above their circumstances.\nWith their charismatic leadership, the Cough City Crew quickly gained a reputation for their audacity, resourcefulness, and ruthless tactics. They carved out territories within the city, establishing themselves as a force to be reckoned with, challenging the oppressive rule of the wealthy elite.\nThe crew’s activities ranged from illicit drug trade and smuggling to extortion and organized heists, targeting the symbols of opulence that taunted the impoverished masses. Yet, they weren’t solely driven by criminal enterprises. Beneath the surface, the Cough City Crew harbored a desire to bring attention to the plight of the marginalized, to disrupt the status quo, and to dismantle the barriers that kept the lower classes oppressed.\nTheir actions garnered attention from both law enforcement and rival gangs, leading to fierce turf wars and intense power struggles. The Cough City Crew, however, proved to be a resilient force, adapting to ever-changing circumstances, and always finding new ways to defy their adversaries.\nWithin the gang’s hierarchy, the Founding Four retained their status as the ultimate decision-makers, shaping the crew’s strategies and objectives. Beneath them, a network of lieutenants and enforcers ensured the gang’s operations ran smoothly, while foot soldiers proved their loyalty through acts of violence and unwavering allegiance.\nDespite their reputation for criminal activities, the Cough City Crew held a certain twisted sense of honor within their ranks. They abided by an unwritten code, protecting their own and defending their territories with ferocity. They became a symbol of resistance for the disenfranchised, a beacon of hope for those who felt trapped in the merciless grip of inequality.\nThe story of the Cough City Crew continues to unfold, interwoven with the tumultuous history of Stickyickistan. As their influence waxes and wanes, their legacy endures—a testament to the indomitable spirit of those who rise up against the forces that seek to oppress them."},"Factions/Mandem-on-Booftown":{"title":"Mandem on Booftown","links":[],"tags":[],"content":"Backstory\nIn the neighboring district of Booftown, a rival gang to the Cough City Crew emerged, known as Mandem on Booftown, or MOB for short. Booftown, predominantly populated by the native halflings who had long suffered under the influence of the human settlers, became the breeding ground for this fierce and brutal gang.\nMOB’s origins can be traced back to a time of deep resentment and seething anger within Booftown. The halfling population had endured years of oppression, their rights trampled upon by the dominating human settlers who controlled the city. As the divide between the haves and the have-nots grew wider, a group of halfling individuals decided it was time to take matters into their own hands.\nLed by four charismatic and ruthless figures, MOB rose to prominence as the voice of the marginalized halfling community. The leaders, known by their street names, were Jinx “Razorblade” Willowbark, Felix “Brawler” Thornfoot, Lexi “Scarlet” Bramblethorn, and Remy “Torchlight” Goldleaf. Each of them brought their unique skills and ferocity to the forefront, earning their positions as the key figures within the gang.\nUnlike their rival, the Cough City Crew, MOB emphasized brutality and intimidation over finesse and strategy. They earned a reputation for their ruthless tactics, leaving a trail of violence and chaos in their wake. Their methods were often crude, employing fear and sheer force to establish dominance within their territories.\nThe name “Mandem on Booftown” reflected their close-knit unity and loyalty to their native district. “Mandem” was a term used by halflings to refer to a tight-knit group of friends or associates, emphasizing the bond that united the gang members. Booftown, despite its oppressive conditions, was their home, and MOB was determined to make their mark within it.\nMOB’s activities included extortion, racketeering, and brutal acts of violence against rival gangs and those who opposed their rule. They targeted the symbols of human affluence and authority, seeking to dismantle the structures that had oppressed their community for far too long. They operated with a blatant disregard for the law, viewing themselves as the enforcers of their own brand of justice.\nWithin the gang’s hierarchy, the four leaders remained at the top, overseeing the gang’s operations and ensuring their message of rebellion reverberated throughout Booftown. Beneath them, lieutenants and enforcers enforced MOB’s rule with an iron fist, instilling fear in the hearts of those who dared to challenge their authority.\nWhile MOB may have lacked the finesse and strategic acumen of their rivals, the Cough City Crew, they made up for it with their sheer brutality and unwavering determination. They were a force to be reckoned with, unleashing their fury upon any who dared to cross their path.\nAs the rivalry between MOB and the Cough City Crew intensified, the streets of Stickyickistan became a battleground for power and control. The clashes between the two gangs were marked by bloodshed and devastation, leaving a lasting impact on the city and its inhabitants.\nMOB’s legacy would forever be intertwined with the struggle for justice and liberation within Booftown. While their methods may have been harsh and their actions ruthless, they served as a symbol of defiance for the marginalized halfling community—a stark reminder that sometimes, strength and brutality were the only means of survival against overwhelming odds."},"Factions/Nevercough-Tribunal":{"title":"Nevercough Tribunal","links":["Dabnar-Nevercough","Stickyickistan","Human-Colonialism"],"tags":[],"content":"\nHead Magistrate Dabnar Nevercough rules with his best intentions in mind, and appoints many figures with questionable motives, but none that would question his authority.\nThe Tribunal considers itself to be the mediator and controller of all other guilds’, and noble houses activities, even though most of its countless decrees are largely ignored.\nThat’s not to say the Tribunal is impotent, however—its legitimacy and reach wax and wane over time depending on economics, cultural trends, and the reaction to other guilds’ overreach.\nAt its best, the ultra-hierarchical Nevercough Tribunal is just, farsighted, and impartial. At its worst, the guild is cold, stultifying, and bureaucratic.\n\nThe Three Columns.\nThe trias politica structure of the Nevercough Tribunal has existed nearly since the beginning of Stickyickistan but had been theoretical and unimportant for millennia. With the ambitions of Human Colonialism to construct a new civilization, the Tribunal revivified the concept, and it has become deeply meaningful and reflective of the guild’s structure and hierarchy.\n\nVeridic Column. Comparable to a judiciary branch, this Column adjudicates, arbitrates, mediates, and studies the effects of Stickyickistanian law.\nLexis Column. This is the legislative part of the guild—the actual makers of law, including assessing the need for new laws and formulating their language.\nAuctoritas Column. Putting laws into practice, as well as enforcement of them, is the domain of the Auctoritas Column.\n\nRoles Within the Nevercough Tribunal\nThe tribunal’s uses of magic tend to fall into three functions: establish, maintain, refine (or alternatively: build, defend, improve). Although these functions might seem to map cleanly to the Columns (Lexis, Auctoritas, and Veridic), all three functions find expression in all three Columns. Examples include:\n\nHussars and Infantry\nLawmages and Hieromancers\nKonstructors\nElocutors\nArresters\n"},"Factions/The-Norfies":{"title":"The Norfies","links":["House-Vadalis","Sources/Eberron","POI's/The-North-Booftown-Downs","Handler's-Guild","Regions/North-Booftown","Misc/Alcohol","Stickyickistan"],"tags":[],"content":"\nLoosely based on House Vadalis from Eberron\nOwners of the The North Booftown Downs\nOn the surface it would seem the most significant trade for The Norfies is in the breeding and training of animals. Mainly horses, but they dabble in many things.\nThey also run the Handler’s Guild\nThey are based out of North Booftown in a large plantation style home with large pastures of livestock, and stables.\nNorfies members that are also part of the Handler’s Guild possess magical abilities related to calming and controlling animals, allowing them to domesticate even the most exotic and difficult beasts.\nThe Norfies have turned this gift into a booming business in magebred animals and become industry leaders in livestock breeding and animal training.\nThe Handlers Guild is treated as a separate organization to the house.\nAbove all else, The Norfies are a family and the family comes above all.\nTo become a member of The Norfies, one must be human and either be born into it or else marry into it.\nAlthough heirs may marry for love, all such marriages must be thoroughly examined with regard to the bloodlines of both participants, just as they do with their beasts, before being approved by a council of family elders, and they accept such new members infrequently.\nThey do, however, “hire” “employees” because animal handling isn’t the only business they deal in.\nThe Norfies are mostly known by the public for their horses, and race track, but behind closed doors they operate the largest illicit Alcohol distribution ring in Stickyickistan among their other nefarious dealings.\nThey will often “hire” people from outside the family to work for them, and create plausible deniability for themselves. This often means they are trying to find brewer’s, and alchemists to help make the product, and mercenaries to move it.\nThey are also involved in some hush-hush high stakes gambling, and race fixing at the downs\n"},"Factions/The-Plague-Plugz":{"title":"The Plague Plugz","links":["Species/Wererats","POI's/Puffer's-Pottery"],"tags":[],"content":"A gang of Wererats that sell poison from the basement of a store called Puffer’s Pottery.\n\nPuffer Silvers\nRikki Tweeks\nWilbur Greasfur\nNibbler Nash\nTrilla Scraggs\n"},"Factions/The-Seekers-of-the-Vein":{"title":"The Seekers of the Vein","links":["Misc/Arcanite","Regions/Mount-Zooka","Regions/The-Outback"],"tags":[],"content":"A guild of prospectors and mercenaries specializing in uncovering hidden Arcanite deposits and magical relics. Their operations extend from Mount Zooka’s treacherous rim to the deepest jungle in The Outback."},"Factions/Tribunal-Highblade-Coalition/Highblades-Guild":{"title":"Highblades Guild","links":["Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII"],"tags":[],"content":"This is the guild of swords for hire belonging to the Tribunal Highblade Coalition. The bounty hunting squad Dusk Flame VII belongs to this guild."},"Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII":{"title":"Dusk Flame VII","links":["Factions/Tribunal-Highblade-Coalition/Highblades-Guild","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","NPC's/Hazeus-Tokenheim","NPC's/Sizzle-Scorchmane","NPC's/Solmenda","NPC's/Sir-Ashwyn-Highblade","NPC's/Thistlebog"],"tags":[],"content":"This is a squad of Highblades Guild bounty hunters.\nLore\nThis squad has been tasked with executing a discreet hit on the members of Unit BH-Umbra Δ9 at the request of Hazeus Tokenheim.\nMembers\n\nSizzle Scorchmane\nSolmenda\nSir Ashwyn Highblade\nThistlebog\n\nAllies\n\nHazeus Tokenheim\n\nEnemies\n\nUnit BH-Umbra Δ9\n"},"Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition":{"title":"Tribunal Highblade Coalition","links":["House-Deneith","Sources/Eberron","Stickyickistan","Human-Colonialism","Factions/Nevercough-Tribunal","Regions/Upper-South-Booftown","Lower-South-Booftown","Species/Halflings","Regions/The-Outback","Human","Factions/Tribunal-Highblade-Coalition/Highblades-Guild","POI's/Highblade-Tower","Regions/Nevercough-Island","The-Forgewright-Guild","Factions/The-Seekers-of-the-Vein","Warforged","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society"],"tags":[],"content":"\nBased on House Deneith from Eberron\nWas once just a militant noble family in Stickyickistan around the beginning of Human Colonialism named the House of Highblade.\nWith the blessing of the Nevercough Tribunal empowering their military might, the coalition was formed, and a campaign of conquest throughout the regions of the city now known as Upper South Booftown and Lower South Booftown.\nAt the time these places were sparsely inhabited, but fiercely defended by several different factions of native Halflings. Very few of these factions still exists, and if they do, they operate on the fringes of the city or the depths of The Outback.\nDespite having strong ties to the Nevercough Tribunal, and the majority of its members being Human, the coalition remains neutral in all foreign affairs.\nThe coalition earned its status as a private mercenary house during Human Colonialism by offering soldiers from its Highblades Guild to the cause.\nThe coalition is based out of Highblade Tower downtown on Nevercough Island\nSince the end of Human Colonialism, however, it has become confrontational with The Forgewright Guild and The Seekers of the Vein. The reason for this is simply business: THC see The Forgewright Guild’s Warforged and The Seekers of the Vein’s prospecting mercenaries, and the Ashen Shadow Society’s lawless bounty hunters as potential threats or competition to their soldiers-for-hire.\n"},"Factions/Verdanfey":{"title":"Verdanfey","links":["Deities/The-Three-Sisters/The-Three-Sisters","Deities/The-Three-Sisters/Darana","Deities/The-Three-Sisters/Ashalla"],"tags":[],"content":"In the early nights of the world, The Three Sisters found that despite their love for each other, they could not agree on the proper way to shape the natural world. Rather than fight, they elected to share influence over the material realm. Darana, embodying neutrality, was pleased with the balance between her sisters. While her sisters accepted this compromise, each desired to shape a realm in accord with their own conception of ethics. To this end, Ashalla created a plane parallel to that of the material realm and imbued it with strong positive energy.\nTo populate her new realm, Ashalla invited good and neutral fey to join her. She also extended an invitation to elves, gnomes, and even some dwarves and humans. As for the plants and animals, she either imported them or created them as needed. While many of the inhabitants of the realm are good, not all are. The influence of Ashalla does mean that few evil creatures dwell permanently in the realm, so peaceful visitors will rarely face anything more threatening than cruel pranks.\nThe Verdanfey resembles the natural material world but can be best described as having a stronger living presence: plants and animals are more robust, colors are more vivid, water is clearer, and so on. Because the Verdanfey is infused with positive energy, all living creatures in the Verdanfey gain “vulnerability” to healing and necrotic resistance. If a creature is normally vulnerable to necrotic damage, that vulnerability is suppressed in the Verdanfey. If a creature is normally resistant to necrotic damage, it becomes immune while in the Verdanfey. Undead creatures find the powerful positive energy of the Verdanfey unpleasant and disruptive. Whenever they make an attack roll or a saving throw, they must roll a d4 and subtract the number rolled from the attack roll or saving throw.\nAn odd feature of the Verdanfey is that it contains no native iron ore; instead, it has fey silver. This metal can be worked like iron, though it is lighter. Material plane iron brought to the Verdanfey grows slightly warm and erratically emits faint sparks, as if the realm were trying to reject it. Many creatures of the Verdanfey find cold iron to be unpleasant, and to some, it is toxic. Inhabitants of the Verdanfey often refer to the material plane as the “Ironlands,” sometimes in a derisive manner.\nWhile the Verdanfey is a distinct plane, it is coextensive with parts of the material plane. Because of this, the Verdanfey and material plane often resemble each other, albeit with some important differences. For example, a material plane river is likely to have a Verdanfey counterpart, but this counterpart is likely to be a larger river with cleaner water and a faster current. There are numerous weak spots in the barrier between the realms that allow intentional and accidental travel between them. These spots are often important to druids, and some are marked with special trees or rings of standing stones. The opening of such gateways is often marked with a strange weather event, such as a lightning storm with oddly colored lightning and strangely musical thunder. Certain evil beings watch for these storms, eager to intrude into the Verdanfey."},"Factions/Zooka-Mire-Collective":{"title":"Zooka Mire Collective","links":["Golgari-Swarm","Regions/The-Outback","Regions/Zooka-Mire","Stickyickistan","Species/Halflings","Fester-Von-Zaaza","The-Rotwake","Zaazarin","Mortispora","Gutterhive","NPC's/Sibrek-Hollowspore"],"tags":[],"content":"A small breakaway sect of the Golgari Swarm that has found their way to Stickyickistan, and inhabit a swampy region of The Outback just outside city limits known as Zooka Mire.\n\nThe Zooka Mire Collective is the guild that fuses the opposite values of life and death, fostering growth in Stickyickistan’s decaying communities but also fostering decay in places of growth.\nThe Halflings, zombies, insects, and undead-plant hybrids of Zooka Mire are like one massive, growing, feeding organism, collectively spreading across the land wherever it can fit.\nThe Zooka Mire Collective provide a necessary service in Stickyickistan, in that they dispose of the carcasses, and magitech waste that civilization leaves behind, and mysteriously they also provide sustenance for the forgotten and the downtrodden.\nThey are the scavengers and decomposers at the fringes of the food chain, but yearn to be the predator at the top.\nThe collective is organized more like a single organism than a typical guild: it has a nucleus or nerve center that drives the direction and growth of the collective; elements that collect nutrients and convert them into usable resources; defenses that resist and fight off foreign bodies; and an instinctual drive to survive, reproduce, and overcome.\nThe Zooka Mire Guild Master is currently Fester Von Zaaza an undead necromancer who managed to revive himself after death.\nFester maintains a council of shamans, arcanists, and rogues called The Rotwake. The Rotwake act as a combination of advisory parliament and spy agency and rarely all convene publicly or together at once.\nIn combination with Fester’s insect minions, they act as his sensory apparatus to know what the outer reaches of the collective are doing and as a messenger service to deliver instructions.\nIt might be that an individual of The Rotwake might be considered of higher rank than another by Fester, but none know those rankings beyond the guild master.\nThe Zooka Mire Collective might have more changes in leadership than other guilds. The guild believes in the importance of continuous cycles, understands that assassination is a valid means of political conquest, and knows that being alive is not a prerequisite to rule.\n\nGolgari Roles\n\nthe Zaazarin , Halflings of Zooka Mire.\nthe Mortispora , ranks of the dead\nthe Gutterhive , shepherds of the cycle\n\nNotable Members\n\nFester Von Zaaza\nSibrek Hollowspore\n"},"Items/A.S.S-sending-stones":{"title":"A.S.S sending stones","links":[],"tags":[],"content":"DDB Item\nAt Bloodhound rank, you are given an Ashen Shadow Society Sending Stone, an uncommon magic item that resembles a gemstone in a bold setting. It functions like a normal Sending Stones except that it has no matching stone and allows communication with an info tech at the Ashen Citadel. A DC 10 Intelligence (Arcana) check must be made to successfully make contact. Once you attempt to make contact, you can’t make another attempt until you short rest. Once the stone is successfully used, it can’t be used again until the next dawn.\nMaking contact with a squad member assumes that they are in possession of their own Ashen Shadow Society Sending Stone."},"Items/Sigil-Bound-Gate-Band":{"title":"Sigil Bound Gate Band","links":[],"tags":[],"content":"DDB Item\nThis ring is a gold band with a unique sigil combination inscribed on the band. The unique sigil combination is the same combination of sigils used to create the Teleportation Circle, and links the ring to it. While attuned to this ring, and within at least 250sq km of the linked Teleportation Circle, as an action or reaction to a friendly creature being hit, the wearer can choose up to three other willing non-incapacitated creatures that they can see, and activate the ring by tracing a circular sigil in the air. If the ring is activated as an action, the wearer immediately teleports to a safe space within 5ft of the linked Teleportation Circle, or the next closest safe space. Each creature they targeted with the ring becomes encircled by a spectral ring of the unique sigil combination, and is teleported within 5ft of the Teleportation Circle, or the next closest safe space at the beginning of their next turn provided they stay above 0 hp. If the ring is used as a reaction to a friendly creature getting hit, the wearer can choose to immediately teleport the friendly creature within 5ft of the Teleportation Circle, or the next closest safe space before they are hit, and wait until the start of their own next turn to be teleported within 5ft of the Teleportation Circle, or the next closest safe space provided they stay above 0 hp. If used out of combat, all targeted creatures are immediately teleported within 5ft of the Teleportation Circle, or the next closest safe space. This cannot be done again until the wearer has long rested.\nThe sigils inscribed on the ring can be removed by casting Mending on it, which turns it back into a non-magical gold band. Any gold ring can be used to create a Sigil Bound Gateway Band. First you must have a Teleportation Circle. Then you need to engrave the unique sigil combination of the teleportation circle into the band which can be done with a DC 13 sleight of hand check, or the use of Jeweler’s Tools. If the sleight of hand check is failed, they can cast Mending on it and try again. After the sigils have been engraved, the ring must be brought within 5ft of the Teleportation Circle every day for a month to become linked."},"Misc/Alcohol":{"title":"Alcohol","links":["Factions/Nevercough-Tribunal","Stickyickistan","Misc/Arcannabis"],"tags":[],"content":"Alcohol has been banned by the Nevercough Tribunal throughout all of Stickyickistan. This law is not often followed, and many citizens believe it should be legalized. The Tribunal cited the serious health risks related to alcohol consumption as the main reason for the prohibition, but nearly everyone knows that the real reason is because they are “donated” large sums of money from Big Arcannabis. Large Arcannabis businesses saw alcohol as a threat since very early on in the history of Stickyickistan, and it has become a cultural taboo of sorts. Those who drink alcohol are considered part of a counter-culture."},"Misc/Arcanite":{"title":"Arcanite","links":["Stickyickistan","Regions/Mount-Zooka","Species/Dwarf","Misc/Magitech","Species/Halflings"],"tags":[],"content":"Arcanite is the solid material element form of weave magic. Arcanite is incredibly rare in the multiverse, but not so much in Stickyickistan. High traces of this raw magical element can be found throughout the soil on the island, and Mount Zooka is a specific kind of volcano known as an Arcanite Cone. This kind of volcano can occur naturally when certain conditions are met, and the island now known as Stickyickistan is right in the goldilocks zone for this to happen. An Arcanite Cone often belches up Arcanite from the depths of the planet into the crater at the peak of the mountain. Dwarf miners are often employed to venture into the rim of the crater, and extract large amounts of Arcanite which is then used to power the city’s Magitech grid, enchant items, and exported to other elsewhere in the realm. Arcanite is the driving force behind the high-magic of Stickyickistan. Some Halflings with ancestry native to the island have been slightly altered by the Arcanite rich environment giving them some innate arcane skills."},"Misc/Arcannabis-Cultivation":{"title":"Arcannabis Cultivation","links":["Regions/The-Outback","Misc/Arcannabis"],"tags":[],"content":"Pre-enchanted Seeds\nMeant to mirror Cannabis Ruderalis. These seeds have been harvested by a professional grower. These seeds have their genetics stabilized, and feminized meaning they will always grow into a female plant that produces enough for 3 uses of whatever enchantment is applied. The amount of time the plant takes to fully mature is 1d6+3 weeks in game time.\nVirgin Seeds\nMeant to mirror Photoperiodic Cannabis varieties. Virgin Seeds are wild seeds that have been procured from The Outback, and need to be enchanted before they can be planted, or they grow non-magical cannabis. The amount of time the plant takes to fully mature is 1d6+5 weeks in game time.\nEnchantment\nTo enchant seeds the PC needs proficiency in Alchemist’s Supplies, all of the components required to cast the spell they want to enchant the seed with, and the ability to cast the spell themselves, or a scroll of the spell. Using the Alchemist’s Supplies all materials are combined, and expended. This creates one enchanted seed. The pollen from an enchanted Arcannabis plant can be used on the plant that sprouts from a virgin seed. Doing this pollinates the virgin plant with enchanted seeds. Using pollen from non-magical cannabis will annul any enchantment the mother plant had if any. Using Feminized pollen means the seeds from the pollinated plant can only produce a female plant, and adopts the spell of the plant the pollen came from.\nBiological Sex\nBy default there is a 45% (1 - 45 on d100) chance a seed will be male, 45% (46 - 90 on d100) chance it will be female, and a 10% (91 - 100 on d100) chance of a hermaphrodite. You can make or buy, and apply an alchemical solution to the plant that will guarantee the gender to be female, and a solution that makes any plant herm. Male plants produce pollen, female plants produce the actual enchanted flowers that are smoked, and a hermaphrodite will produce both. A female plant grows 1d4+1 uses of the spell it is enchanted with, unless it gets pollinated, or dies. If a female plant is pollinated it produces 1d8+2 seeds, but no flowers. A male plant produces enough pollen upon harvesting to pollinate 1d6+6 female plants. A hermaphrodite will produce 1d4-2 (min. 0) smokable flowers, and enough feminized pollen to pollinate 1d4 female plants."},"Misc/Arcannabis":{"title":"Arcannabis","links":["Misc/Arcanite","Misc/Arcannabis-Cultivation"],"tags":[],"content":"Arcannabis is an enchanted cannabis plant from Stickyickistan. Arcannabis does naturally occur in the Arcanite rich soils of Stickyickistan’s Outback, but it is uncommon. Arcannabis Cultivation however, is very common. Generally seeds are produced by trained alchemists, then sold to farmers and individuals."},"Misc/Elemental-Trees":{"title":"Elemental Trees","links":["Misc/Arcanite","Stickyickistan","Elemental-Vehicles"],"tags":[],"content":"Aside from their magical nature caused by the Arcanite rich soil of Stickyickistan, Elemental Trees are the same as normal trees. Being wood, they have AC 15 (as per the object rules) and are plants. Hit points range from 1 (sapling) to 100+ (gigantic tree). Elemental Trees have an unintended defense mechanism: when damaged, they emit a burst of their energy type. The damage is normally 1d6 and the DC for the saving throw is 10. This can be adjusted for the tree size or its “power” as desired. Elemental Trees are immune to their own energy type. Some energy trees have an unusual degree of awareness and will react proactively to perceived threats. These trees have 60 ft tremor sense and can attack a target within 30 feet—this uses the same damage and saving throw as the normal mechanics. Radiant trees can detect the presence of undead creatures within 30 feet and will always attack them with their radiant energy. Necrotic trees can detect the presence of living creatures within 30 feet and will always attack non-plants within that range. The wood from these trees if often used to power different Elemental Vehicles like airships, and cars.\nAcid Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10\nDexterity saving throw, taking 3 (1d6) acid damage on a failed save, or half as much damage on a\nsuccessful one.\nFire Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10 Dexterity saving throw, taking 3 (1d6) fire damage on a failed save, or half as much damage on a successful one.\nLightning Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10 Dexterity saving throw, taking 3 (1d6) lightning damage on a failed save, or half as much damage on a successful one.\nNecrotic Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10\nConstitution saving throw, taking 3 (1d6) necrotic damage on a failed save, or half as much damage on a successful one.\nPoison Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10\nConstitution saving throw, taking 3 (1d6) poison damage on a failed save, or half as much damage on a successful one.\nRadiant Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10 Dexterity saving throw, taking 3 (1d6) radiant damage on a failed save, or half as much damage on\na successful one.\nThunder Tree\nA creature that hits the tree with a melee attack while within 5 feet of it must make a DC 10\nConstitution saving throw, taking 3 (1d6) thunder damage on a failed save, or half as much damage on a successful one.\nCRAFTING WITH ENERGY TREES\nWhile the crafting of magical items usually requires exotic ingredients, using the wood of an\nenergy tree in the appropriate way can improve an item. But their use in crafting is not without risk.\nThe simplest version of these optional crafting rules is to apply them only to wands that cast a\nsingle spell that does energy damage corresponding to an energy tree. Alternatively, the rules could apply to any wooden item that can cast a spell doing the right sort of damage, such as a staff of fire or a staff of power. If the spells all have the same damage type, then the benefits would apply to all the spells. If the spells have different damage types (or do not do damage)\nthen the benefits would only apply to the energy type corresponding to the wood used. This could be simplified by allowing multiple types of wood to be used in an item so the benefit would apply to all damaging energy spells. Crafting with this material is not without danger and risk. Each hour spent crafting an item with this wood inflicts 1d6 damage of the appropriate energy type on the crafter. For the sake of simplicity, apply the damage at the end of each hour. The crafter must also make a DC 15 Intelligence (Arcana) check to properly utilize the wood. If the roll fails, roll on the failure table. If the roll succeeds, roll on the success table.\nFailure Table\nRoll d20\n\n1-10 The item is completed but has no special properties.\n11-15 The item is ruined but half the value of the materials can be salvaged.\n16-19 The item is ruined, and all the material is rendered useless and valueless.\n20 The item explodes. Each creature in a 20-foot-radius sphere centered on the item\nmust make a DC 15 saving throw. A target takes 8d6 damage on a failed save, or half\nas much damage on a successful one. See the damage and saving throw table.\n\nDamage and Saving Throw Table\n\nDamage Type - Saving Throw Type\nAcid - Dexterity\n\n\nDexterity\n\n\nLightning - Dexterity\nNecrotic - Constitution\nPoison - Constitution\nRadiant - Dexterity\nThunder - Constitution\n\nSuccess Table\nRoll d20\n\n1-5 +1 to Save DC or Attack*\n6-10 1 extra charge\n11-15 +1 damage\n18 A spell casts at 1 level higher at no extra cost in charges.\n19 Roll twice, ignoring another 19 or 20.\n20 Roll three times, ignoring another 19 or 20\n\n*If an item has an attack and a save, pick one."},"Misc/Fist":{"title":"Fist","links":[],"tags":[],"content":"Texas Hold ‘em Poker d6 adaptation.\nDictionary\n\nFist = Hand\nSB = Small Blind\nBB = Big Blind\n\nPlaying\nA big and small blind will be identified by using d20 rolls. Highest in roll is small blind, and the next highest is big blind. Ante won’t scale throughout the game for simplicity sake. Minimum buy in is 50gp, maximum is 500gp. SB pays 1gp, and BB pays 2gp to start the pot, then everyone rolls 2d6 to themselves (and GM). Based on these rolls the players can take the normal poker actions of call, raise, fold. After all pre-flop actions are taken the house dealer rolls the 3d6 flop, and the game progresses as a normal poker game would with players connecting a 5d6 “Fist” with their 2d6 and 3d6 from the board. Fists are as follows from highest to lowest:\nFists Best to Worst\n\nFive-of-a-kind\nFour-of-a-kind\nFull House\nStraight\nThree-of-a-kind\nTwo-pair\nPair\n"},"Misc/Fizzlebud":{"title":"Fizzlebud","links":["Misc/Magitech","Misc/Arcannabis","Stickyickistan"],"tags":[],"content":"Fizzlebud is a mildly arcane variant of cannabis that causes carbonation-like fizzing when steeped, and feelings of euphoria, disorientation, and lowered inhibitions when imbibed. Often used in experimental Magitech fermentation. While it is commonly believed to be a variety of Arcannabis, it is actually a completely different species according to botanists of Stickyickistan, although it is very closely related."},"Misc/Hollowspore's-Squire":{"title":"Hollowspore's Squire","links":["Sources/Dragonlance"],"tags":[],"content":"Hollowspore’s Squire - (Flavored Dragonlance Feats)\nYou are a Mycoforged (Fungal Warforged) created by Sibrek Hollowspore of the Zooka Mire Collective (Golgari Swarm). Sibrek imbued you with combat enhancements, believing you would serve as the ultimate weapon.\nAbility Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\nMolded Reflexes: Sibrek’s enhancements allow you to mount or dismount with unnatural ease, only requiring 5 feet of movement.\nAdaptive Strikes: Engineered for precision, you can momentarily recalibrate your attacks, granting yourself advantage once per turn and increasing the lethality of his strikes. Once per turn, when you make a weapon attack roll against a creature, you can cause the attack roll to have advantage. If the attack hits, you roll 1d8 and add the number rolled as a bonus to the attack’s damage roll. You can use this benefit a number of times equal to your proficiency bonus, but a use is expended only if the attack hits. You regain all expended uses when you finish a long rest.\nFear-Inducing Presence: Though unintended, your fungal mutations instill dread. You can channel this unsettling aura into your attacks, forcing foes to fight through terror or falter in their resolve. Once per turn, when you hit a creature with a weapon attack roll, you can attempt to frighten that target. The target must make a Wisdom saving throw (DC equals 8 + your proficiency bonus + the ability modifier of the score increased by this feat). On a failed save, the target is frightened of you until the end of your next turn. On a successful save, the target has disadvantage on the next attack roll it makes before the end of its next turn. You can use this benefit a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},"Misc/Impairment-Levels":{"title":"Impairment Levels","links":["Misc/Arcannabis","Misc/Alcohol"],"tags":[],"content":"The amount of Impairment Levels you gain depends on the rarity of the item. All levels go away upon a long rest, and two go away after a short rest. Impairment levels last as long as the spell duration. If there is no spell duration it lasts for 20 minutes.\n\nLevel 1: You are feeling the effects of the Arcannabis or Alcohol\nLevel 2: You now have disadvantage on initiative rolls \nLevel 3: Pass a DC 10 CON save or you can no longer take reactions or use reaction based abilities(Every time you take a reaction  you must make a DC 10 CON save, if you fail the save you can not take your reaction)\nLevel 4:  Pass a DC 10 CON save or have disadvantage on DEX, INT, WIS, CHA saving throws(Every time you make a DEX, INT, WIS, CHA saving throw you must make a DC 10 CON save, if you fail the save your roll has disadvantage)\nLevel 5: You can no longer use reactions and now have disadvantage on on DEX, INT, WIS, CHA saving throws\nLevel 6: Pass a DC 10 CON or become poisoned\nLevel 7: Pass a DC 15 CON or become poisoned\nLevel 8: You become poisoned\nLevel 9: Pass a DC 20 CON or fall prone and unconscious\nLevel 10: You fall prone and unconscious (Zookin’)\n"},"Misc/Magitech":{"title":"Magitech","links":["Stickyickistan","Misc/Arcanite","Regions/Mount-Zooka","Arkanitech-Guild","Regions/Nevercough-Island","Regions/Upper-South-Booftown"],"tags":[],"content":"In Stickyickistan, Magitech is the lifeblood of progress, industry, and warfare—a volatile fusion of arcane energy and mechanical ingenuity that has propelled the city-state into a new era of power and excess. Fueled by Arcanite, the rare magical ore harvested from Mount Zooka, Magitech ranges from simple enchanted tools to experimental war machines, reshaping daily life and the balance of power.\nThe city’s greatest minds—the Arkanitech Guild, rogue artificers, and criminal syndicates—compete to push Magitech further, creating clockwork constructs, arcane firearms, and reality-warping enchantments that blur the line between magic and machinery. The wealthy elite on Nevercough Island flaunt their personal teleportation sigils and self-mending garments, while the slums of Upper South Booftown repurpose discarded Magitech scraps into makeshift weapons and illicit contraptions.\nBut Magitech is as unstable as it is revolutionary. Faulty enchantments lead to catastrophic explosions, experimental constructs gain sentience and go rogue, and overloaded Arcanite batteries have turned entire neighborhoods into ashes. Despite the risks, Stickyickistan’s hunger for innovation and power ensures that Magitech will only continue to evolve—for better or worse."},"Misc/Zooka-Malt":{"title":"Zooka Malt","links":["Misc/Arcannabis","Misc/Fizzlebud"],"tags":[],"content":"Zooka Malt is a beverage similar to ale that is made from a special variety of Arcannabis called Fizzlebud. The effects of Zooka Malt are the same as what you would experience if you drank a beer and smoked a joint."},"NPC's/Arcana-Belle":{"title":"Arcana Belle","links":["tags/Alive","Player-Characters/Fungi","Regions/The-Outback"],"tags":["Alive"],"content":"Alive\nClass: Cleric (Arcana Domain)\nPersonality: Gentle and serene, but with a sharp wit. Arcana Belle is a perfectionist who demands respect for her craft. She’s been in the trade for years and has a loyal following.\nServices: Full restoration of health, cleansing of curses, and minor regeneration (e.g., restoring fingers or toes).\nLore\nHelped heal Fungi when he was infested by bugs from The Outback for a very good price. She may ask them for a favor in the future because of this."},"NPC's/Grimjaw":{"title":"Grimjaw","links":["tags/Dead","tags/CCC","Factions/Cough-City-Crew","Vex","Whisper","Arcannabis-Extraction","NPC's/Hazeus-Tokenheim","Indicus-Sativalin","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9"],"tags":["Dead","CCC"],"content":"Dead CCC\nGrimjaw was a member of the Cough City Crew. He was a highly respected member of the gang known for his brutal tactics, and signature face mask. He wore his face mask because of a birth defect that caused his jaw bone to be deformed severely. Grimjaw had an alliance with two other high ranking gang members named Vex, and Whisper. They worked together to pull off a heist of an incredibly expensive Arcannabis Extraction machine from Hazeus Tokenheim for Indicus Sativalin. The heist was successful, but they were eventually hunted down by hired hitters from the Ashen Shadow Society known as Unit BH-Umbra Δ9. The bounty hunters ultimately claimed the bounty on Grimjaw’s head that he had been racking up over years of criminal activity."},"NPC's/Hazeus-Tokenheim":{"title":"Hazeus Tokenheim","links":["tags/Alive"],"tags":["Alive"],"content":"Alive"},"NPC's/Kezrin-Malvek":{"title":"Kezrin Malvek","links":["tags/Alive","tags/ASS","Orc","POI's/The-Rusted-Chalice","Regions/The-Outback","Encounters/Giant-Centipede-Hunt","POI's/Puffer's-Pottery"],"tags":["Alive","ASS"],"content":"Alive ASS\nStat Block\nRace: Orc\nRank: 1\nRenown: 8\nPersonality: Gruff and no-nonsense. Kezrin values results over niceties and has little patience for talkers or show-offs. Despite this, they have a soft spot for underdogs.\nBackstory: Kezrin was part of a full squad of four, but on a botched job, his fellow squad members perished. Right now he has found himself between squads. As an accomplished operative, Kezrin has proved he is too valuable of an asset to be sent down to the Support Squad, so he has been spending his days roving from tavern, to casino, to brothel, to bed, and back again while he waits to be assigned to a new squad. This means work has been non-existent for him for the last little while, and he needs some help making a little dosh.\nEncounter: Kezrin can be found drinking and smoking away his last few pieces of silver and gold at The Rusted Chalice any time of day. If the party approaches him, he will explain his situation to them, and will ask for them to take pity on him and help with a small bounty. It would be dangerous for him to do solo, and he has little to offer them in return, but it would be a great help to him in getting back on his feet. He has been tasked by a shady group, that he won’t name as they have asked for anonymity from him, to go into The Outback for a Giant Centipede Hunt to collect venom for brewing poison.\nResult: The party will not receive gold or payment of any kind, but Kezrin will let them in on a secret. Thanks for the help with that. You know I said I didn’t have anything for ya, but fuck it. I’ll let you in on a little something. He will then look both ways to make sure no one is watching or listening. He then leans in even closer, and quietly says “Puffer’s Pottery Downtown”. He then gives them a wink, and heads off."},"NPC's/Sibrek-Hollowspore":{"title":"Sibrek Hollowspore","links":["tags/Alive","Arkanitech-Guild","Factions/Zooka-Mire-Collective","Mycoforged","The-Mycotic-Forge","Sporeborne-Legion","Player-Characters/Fungi","Misc/Hollowspore's-Squire"],"tags":["Alive"],"content":"Alive\nSibrek Hollowspore the Mycotyrant Artificer\nSibrek Hollowspore was once a disenfranchised Arkanitech Guild biomancer, cast out for delving too deeply into the forbidden overlap of necromancy and artifice. He found solace in the underbelly of Stickyickistan, where the Zooka Mire Collective welcomed his heretical fusion of magitechnology and decay. His experiments led to the birth of Fungoid Warforged known as Mycoforged. Beings that are neither truly alive nor dead, sustained by pulsating mycelium networks instead of arcane cores.\nOperating from The Mycotic Forge hidden deep within the Zooka Mire Collective’s domain, Sibrek scours battlefields and scrapyards for discarded Warforged husks, resurrecting them as Mycoforged, beings whose bodies are encased in creeping lichen and armored fungal plating. His ultimate goal? To spread a Sporeborne Legion, a hybrid of Zooka Mire rot and mechanized endurance—an unkillable army that grows stronger with every death.\nHowever, Sibrek’s creations hunger. The symbiotic fungi within them require organic matter to thrive, and as they consume, they change, evolving in unpredictable and grotesque ways. Some whisper that Sibrek himself is no longer entirely human, his own flesh riddled with parasitic mycelium, his veins pulsing with the lifeblood of the mire.\nHe doesn’t mind. He’s long since accepted the inevitable truth: In the end, all things rot… and all rot is reborn.\nFungi\nFungi was created by Sibrek. Meant to be the first of his kind and a leader to the Sporeborne Legion. Created with this specific role in mind, Fungi was forged as Hollowspore’s Squire which gave the mech sentience, and improved combat capabilities."},"NPC's/Sir-Ashwyn-Highblade":{"title":"Sir Ashwyn Highblade","links":["Factions/Tribunal-Highblade-Coalition/Highblades-Guild","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII","Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition","POI's/Highblade-Tower"],"tags":[],"content":"Sir Ashwyn Highblade Sheet\nMember of the Highblades Guild bounty hunting squad Dusk Flame VII.\n\nMale\nExpert swordsman\nBorn into high society\nAncestral heir of the Tribunal Highblade Coalition\nGrew up in Highblade Tower\n"},"NPC's/Sizzle-Scorchmane":{"title":"Sizzle Scorchmane","links":["Factions/Tribunal-Highblade-Coalition/Highblades-Guild","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII","Regions/Upper-South-Booftown"],"tags":[],"content":"Sizzle Scorchmane Sheet\nLeader of the Highblades Guild bounty hunting squad Dusk Flame VII.\n\nMale\nLeader\nBorn in Upper South Booftown, was poor, wants revenge on rich people.\nEx-military\n"},"NPC's/Solmenda":{"title":"Solmenda","links":["Factions/Tribunal-Highblade-Coalition/Highblades-Guild","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII","Sigil-Bound-Gateway-Band","Deities/Kuutar","Geàrd-Coille-Boireann","Factions/Verdanfey"],"tags":[],"content":"Solmenda Sheet\nMember of the Highblades Guild bounty hunting squad Dusk Flame VII.\n\nFemale\nHas a Sigil Bound Gateway Band\nArcanist\nPriestess of Kuutar, a moon goddess, from a small mountain village with a monastery, is acquaintances with Geàrd Coille Boireann the guardian of the Verdanfey gate\nBorn middle class, is a kumbaya hippie type, all light magic she uses is moonlight instead of sunlight\n"},"NPC's/Thistlebog":{"title":"Thistlebog","links":["Factions/Tribunal-Highblade-Coalition/Highblades-Guild","Factions/Tribunal-Highblade-Coalition/Squads/Dusk-Flame-VII","Species/Halflings","Regions/Upper-South-Booftown","Factions/Mandem-on-Booftown"],"tags":[],"content":"Thistlebog Sheet\nMember of the Highblades Guild bounty hunting squad Dusk Flame VII.\n\nMale\nNative Halflings\nSquad’s most beloved\nScout\nBorn in Upper South Booftown, was poor, survived growing up in Mandem on Booftown territory, has a good heart, people from his hood see him as a hero.\n"},"NPC's/Velindra-Ashveil":{"title":"Velindra Ashveil","links":["tags/Alive","tags/ASS","Tiefling","POI's/The-Rusted-Chalice","Encounters/Abandoned-Castle-Ruins","Regions/The-Outback","Goblins"],"tags":["Alive","ASS"],"content":"Alive ASS\nStat Block\nRace: Tiefling\nRank: 1\nRenown: 3\nPersonality: Charismatic and cunning, Velindra has a flair for the dramatic. She’s prone to exaggeration and loves spinning tales of her (sometimes questionable) exploits.\nEncounter: Velindra can be found at The Rusted Chalice in the evenings. She enjoys playing blackjack, and will be friendly if PC’s decide to play with her. She also might happen to approach them, whatever feels right. Velindra has some info about an Abandoned Castle Ruins in The Outback. She will hype this place up a lot saying that it seemed like a free raid with just a few Goblins hanging around, and a load of loot. She describes some pathetic looking creatures guarding a hoard of gold coins and other items that one would expect from a Dragon. She says that if they give her 50gp she will be willing to spill the beans on where it is. If questioned, she will say she was alone when she came upon it, so she left cause it didn’t look that easy, but with a friend or two it seemed like a piece of cake. Giant piles of gold coins and gems, she will say. A DC 17 Insight check will reveal this to mostly be a lie. She does indeed know of an abandoned castle in the Outback guarded by small creatures, but the amount of wealth they have has been wildly exaggerated, and the creatures guarding it may or may not be Goblins."},"NPC's/Wes-Scantlin":{"title":"Wes Scantlin","links":["tags/Dead","Misc/Zooka-Malt","Regions/Gapejaw-Bog","Gilded-Nug","Factions/Cough-City-Crew","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9"],"tags":["Dead"],"content":"Dead\nAn infamously disgraced singer and bard, from a well known rock band of the realm called Puddle of Mudd. He was once an A-list celebrity, but one night, he got loaded up on Zooka Malt during a party aboard an airship. Getting trashed in the company of high class individuals is one thing, but assaulting a waitress and dangling her off the edge of the airship was a few steps too far. After this horrifying incident, Wes’ name was dragged in the press, and he fell into a deep depression which eventually turned into a psychotic rage. Unable to deal with living a life away from the spotlight, he lost his sanity. Wes scheduled a solo concert to the surprise of everyone that was once a fan. Not many came to the show, and those that did really wish they hadn’t. It turns out the concert was actually a terrorism plot. Wes used his music to disguise the fact that he was reciting verses of an eldritch death ritual. Many showgoers were injured trying to escape when the crowd realized what was happening, and a few even lost their lives. Wes’ motives behind this act are a mystery to all. After this, he fled the city, and used the Gapejaw Bog cave as a hideout for a while.\nDeath\nWes was involved in stealing the Gilded Nug from a high ranking member of the Cough City Crew. Little did he know that there was undercover members of the Ashen Shadow Society posing as CCC members. These A.S.S operatives followed Wes to where he was hiding out, and reported back to their superiors. Eventually Unit BH-Umbra Δ9 was sent to eliminate Wes, and retrieve the Gilded Nug."},"NPC's/Zara-Blackthorn":{"title":"Zara Blackthorn","links":["tags/Alive","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Stickyickistan"],"tags":["Alive"],"content":"Alive\nZara is a high ranking member of the Ashen Shadow Society in Stickyickistan. As a part of The Council of Shadows, her rank exceeds all other known members of the guild besides The Enigmatic Quartet who’s identities remain hidden."},"NPC's/Zook":{"title":"Zook","links":["tags/Dead","Player-Characters/Xon"],"tags":["Dead"],"content":"Dead\nZook is a gnome from a small town elsewhere in the realm. He was Xon’s mentor while they were known as “Nix”. He taught Nix all he knew about being an investigator, and boozing. Tragically he passed away leaving Nix behind."},"POI's/Ashen-Citadel":{"title":"Ashen Citadel","links":["Regions/Nevercough-Island","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Stickyickistan","Misc/Magitech","Combat-Training-Facility"],"tags":[],"content":"Towering over the heart of Nevercough Island, The Ashen Citadel serves as the headquarters of the infamous Ashen Shadow Society—Stickyickistan’s most feared and powerful bounty hunting guild. A fortress of dark stone, reinforced Magitech barriers, and arcane wards, the citadel is both a command center and a fortress, standing as a silent reminder that no one escapes the reach of the A.S.S.\nThe citadel’s lower levels house a Combat Training Facility, forges, an info laboratory and holding cells where captured targets await their fate. Further in, strategists and hunters review high-profile contracts, coordinating their efforts to track down fugitives, rogue mages, and anyone whose capture or elimination pays the right price. The upper levels, shrouded in secrecy, are rumored to contain war rooms, enchanted archives, and private chambers for the Society’s highest-ranking members.\nFew outsiders are permitted inside the Ashen Citadel, and even fewer leave without either a contract in hand or a bounty on their head. In the heart of Stickyickistan’s capital, it is the one place where even the most powerful fear to tread—unless, of course, they come with gold to spend and a name to cross off."},"POI's/Blunts-Blades-and-Bongs":{"title":"Blunts Blades and Bongs","links":["Species/Dwarf","Magnus-Emberforge","Regions/Bongstad"],"tags":[],"content":"Blunts Blades and Bongs is an armory owned and operated by a Dwarf named Magnus Emberforge. The shop is located in the Bongstad region of the city, and gets its inventory from only the finest forges in the city which Magnus and most other dwarves believe to be in Bongstad."},"POI's/Highblade-Tower":{"title":"Highblade Tower","links":["Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition","Regions/Nevercough-Island","Stickyickistan","Factions/Tribunal-Highblade-Coalition/Highblades-Guild"],"tags":[],"content":"Highblade Tower is the Tribunal Highblade Coalition’s ancestral home, and seat of power. Located downtown on Nevercough Island.\nHistory\nHighblade Tower is nearly as old as Stickyickistan itself. Over time, it has been expanded significantly, not only to enhance its facilities but also to accommodate the growing private mercenary house.\nInhabitants\nNoble families in the House send their children (namely heirs) to be fostered here, forging life-long bonds with the coalition, and Highblade Tower.\nHighblade Tower is also the headquarters of the Highblades Guild. They return here between assignments or when they have the time.\nDespite its size, Highblade Tower cannot hold all of the house’s members and hirelings. Thus, they spilled out into Stickyickistan, populating the city with barracks, training facilities, armorers, and weaponsmiths, as well as taverns, to serve the coalition members."},"POI's/Puffer's-Pottery":{"title":"Puffer's Pottery","links":["Species/Wererats","Factions/The-Plague-Plugz"],"tags":[],"content":"On the surface, this is a quaint little shop that sells pottery of varying qualities for a low price. For those that are in the know, it is a front for an underground poison peddling operation run by a gang of Wererats called The Plague Plugz."},"POI's/The-Green-Grimoire":{"title":"The Green Grimoire","links":["Gideon-Cloudwalker","Regions/Nevercough-Island","Shopping-District","Misc/Arcannabis"],"tags":[],"content":"Owned by a gnome named Gideon Cloudwalker, and tucked away in the heart of Nevercough Island’s bustling Shopping District, The Green Grimoire is a herbalist’s haven. This shop is a go-to destination for mages, alchemists, and wealthy thrill-seekers looking for potent Arcannabis."},"POI's/The-Molten-Note":{"title":"The Molten Note","links":["Regions/Nevercough-Island","Misc/Fist"],"tags":[],"content":"The Molten Note is a tavern found downtown on Nevercough Island. A bustling, dimly lit gambling den and music hall, the atmosphere is a mix of smoke, neon glows, and the clinking of enchanted dice. The game of choice at this establishment is Fist."},"POI's/The-North-Booftown-Downs":{"title":"The North Booftown Downs","links":["Stickyickistan","Regions/North-Booftown","Misc/Arcanite","Factions/The-Norfies"],"tags":[],"content":"The North Booftown Downs is Stickyickistan’s premier horse racing track, located in the North Booftown region of the city, is a bustling arena where nobles, merchants, and criminals alike gather to gamble fortunes on enchanted thoroughbreds. By day, it’s a spectacle of speed and sorcery, with horses magically enhanced through selective breeding, Arcanite-infused feed, and alchemical tonics. By night, the track transforms into a shadowy den of backroom deals, rigged bets, and underground high-stakes gambling.\nThe Norfies, a human criminal syndicate, own and operate the Down—at least on paper. In reality, it’s a money-laundering front and a battleground for race-fixing, debt collection, and violent disputes over turf and trade routes. Accusations of enchanted performance enhancers, cursed saddles, and even straight-up hexing rival jockeys are common, but no one dares challenge the results too loudly—at least, not if they value their kneecaps.\nDespite its dubious reputation, the Downs remains one of Stickyickistan’s biggest draws, pulling in tourists, thrill-seekers, and crime lords alike. Whether you’re here to bet, bribe, or break legs, there’s only one rule at the Downs: the house always wins."},"POI's/The-Rusted-Chalice":{"title":"The Rusted Chalice","links":["POI's/Ashen-Citadel","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Warforged","C0B4LT"],"tags":[],"content":"The rusted chalice is a tavern inside the Ashen Citadel for guild members only. Here bounty hunters of the Ashen Shadow Society gamble, smoke, drink, and occasionally take part in cage matches. The bartender of The Rusted Chalice is a Warforged named C0B4LT that was created by a member of the guilds Enigmatic Quartet."},"Player-Characters/Baeriggs-Bigbreath":{"title":"Baeriggs Bigbreath","links":["tags/Alive","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","Species/Dwarf","Regions/Bongstad","Misc/Arcanite","Factions/Nevercough-Tribunal","Military-Academy","Misc/Zooka-Malt","Stickyickistan","Player-Characters/Xon","Player-Characters/Wraith","Player-Characters/Fungi"],"tags":["Alive"],"content":"Alive\nCurrently a 1st rank Ashen Shadow Society bounty hunter. The 1st rank are known as Bloodhounds. Their squad’s name is Unit BH-Umbra Δ9.\nBackstory\nBaeriggs Bigbreath is a Dwarf born in the heart of Bongstad, a sturdy warren of carved stone halls, resonating with the sounds of hammers, pickaxes, and the occasional bellow of a Dwarven tavern fight. It is a modest but lively community where resilience was the currency of survival, especially for Baeriggs.\nAs a child, Baeriggs was teased mercilessly for his unusually large nose—a feature that looked comically oversized on his small frame but eventually became a fitting hallmark of his adult face. The name “Bigbreath” was coined by cruel classmates, though it eventually became an endearing title that Baeriggs wore with pride. His parents, however, worried about their son. His intellect was… lacking. Baeriggs was a kind-hearted soul, but his grasp of logic and numbers was tenuous at best, and his tendency to bet everything on impulse made life an endless exercise in damage control.\nBaeriggs’ father was a miner at Mount Zooka, chiseling Arcanite from the volatile crater’s depths, while his mother stayed home, tending to her son’s “special needs.” Despite Baeriggs’ shortcomings in intelligence, his parents saw his potential in one unmistakable strength—his strength. The gods clearly intended him for greatness, and they knew his path would involve a weapon in his hands. Thus, with heavy hearts, they sent him to the Nevercough Tribunal Military Academy, hoping he could channel his raw power into a disciplined career.\nAt the academy, Baeriggs excelled in combat but struggled with everything else. Strategy sessions and tactical drills were an ordeal, but give him a weapon and point him toward an enemy, and he was unstoppable. His classmates nicknamed him “The Blunt” a title that Baeriggs didn’t fully understand but wore proudly.\nOne fateful night, while blowing off steam in Stickyickistan’s bustling downtown, Baeriggs found himself at a dice game. Fueled by Zooka Malt and a rare winning streak, he made a bet so wild it attracted the attention of the wrong crowd. When he lost, he was dragged from the tavern by four shady figures—members of the Ashen Shadow Society, Stickyickistan’s infamous bounty hunting guild. Misunderstandings and miscommunications culminated in Baeriggs being interrogated in a dimly lit room for hours.\nOddly enough, the interrogation became a comedy of errors. The Ashen Shadow Society mistook Baeriggs for someone else entirely, and Baeriggs, in his limited understanding, believed he did hold a secret—a secret so secret that even he didn’t know it. His genuine confusion and unflinching resilience impressed his captors. When the misunderstanding was cleared up, they offered him an unusual proposition: join their ranks.\nBaeriggs accepted, seeing the opportunity as a divine calling. As a recruit for the Ashen Shadow Society, he thrived in combat drills and proved an unstoppable force during missions. While his intelligence often left his squad mates groaning, his sheer determination, strength, and inability to comprehend fear made him an invaluable ally. He even developed an unintentional knack for bluffing—his earnest confusion often read as impenetrable confidence to those trying to read him.\nNow, Baeriggs has been given his own squad, forming an unlikely trio with his comrades, Xon, Wraith, and Fungi. Together, they take on bounties, navigating the chaos of Stickyickistan with a mix of brute force, accidental brilliance, and a healthy dose of luck. Baeriggs still visits his parents in Bongstad when he can, though he refuses to buy any weapons or armor from anywhere but his hometown—a stubborn loyalty to his roots. His gambling habit remains intact, though his squad mates now keep a closer eye on him when dice or Zooka Malt are involved.\nThrough it all, Baeriggs believes his path is divinely guided, and his unshakable faith in the gods (and himself) fuels his zealot’s rage. Whether smashing through a tavern brawl, leading his squad into battle, or confusing his enemies into surrender, Baeriggs Bigbreath is proof that greatness doesn’t require brilliance—just a big nose, a bigger heart, and the biggest mace in the room."},"Player-Characters/Fungi":{"title":"Fungi","links":["tags/Alive","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","Regions/The-Outback","Warforged","NPC's/Zara-Blackthorn","Regions/Zooka-Mire","Regions/Mount-Zooka","The-Mycotic-Forge","NPC's/Sibrek-Hollowspore","Factions/Zooka-Mire-Collective","Arkanitech-Guild","Misc/Magitech","Golgari-Swarm","Mycoforged"],"tags":["Alive"],"content":"Alive\nCurrently a 1st rank Ashen Shadow Society bounty hunter. The 1st rank are known as Bloodhounds. Their squad’s name is Unit BH-Umbra Δ9.\nBackstory\nFungi, the Forgotten Construct\nFungi has no memory of his origins. His first recollections are a haze of decay and darkness, the air thick with the scent of rot. Then, he was running—his legs carrying him blindly through the vast, moonlit expanse of The Outback. When he blacked out, he awoke in a clearing, surrounded by a perfect ring of button mushrooms. His body, covered in a silk-like white mycelial structure, bore small fruiting bodies sprouting from his form. He had no idea where he was—or even who he was.\nFor a time, Fungi wandered the wilderness, drawn to the quiet wisdom of nature. He studied the mushrooms, lichen, and molds that thrived in the Outback, feeling an inexplicable kinship with them. The forest became both his sanctuary and his teacher, guiding him in ways no mentor could. He discovered that the world respected him as he respected it, and in time, his knowledge of the natural world allowed him to tap into primal magics, manifesting druidic abilities that helped him survive.\nOne day, while walking through the dense brush, he stumbled upon something foreign—a cobbled path. Unlike the soft forest floor, it was devoid of life, its cold, hard stones suffocating under his feet. Curious, he followed it, instinctively spreading small filaments of his own mycelium into the cracks between the bricks. The road led him to a place unlike anything he had ever seen—the sprawling city of Stickyickistan.\nThe city overwhelmed him at first. Towering structures stretched toward the sky, and people moved in endless currents, oblivious to his presence. He avoided the city’s heart, instead lingering at its fringes, finding solace in abandoned places and neglected spaces. A hemp paper processing plant became a reliable source of sustenance, its discarded fibers providing nourishment. Farmers often spotted him at the edges of pastures, carefully collecting cow patties to cultivate the fungal strains he found most fascinating.\nAs he honed his druidic skills in this strange new world, the Ashen Shadow Society (A.S.S.) took notice of him. The guild’s scrying systems caught glimpses of his unique form, and their interest was piqued. They had seen constructs before—Warforged were not unheard of—but none like him. Fungi was something else, something new.\nA novice squad was dispatched to make contact. Fungi, distrustful and wary, resisted at first. However, when one of the operatives presented him with a small stone covered in a rainbow lichen, he was immediately captivated. He took the stone into his hands, admiring the intricate symbiosis of life upon it. It was enough to calm him, and he agreed to accompany them to the Citadel.\nOnce within the city’s heart, he was studied and assessed. His biology was unlike anything the guild had encountered before. They ran tests, probed his fungal structure, and recorded his reactions. A week later, Zara Blackthorn introduced him to his new squad. He was no longer just a wanderer—he was part of something. But even as he settled into his new life, his past remained a void, a missing piece he could not grasp.\nThe Truth Beneath the Mire\nFungi’s true origins lie deep beneath the swampy expanse of Zooka Mire, at the base of Mount Zooka. The Mycotic Forge, a hidden laboratory of decay and rebirth, was the birthplace of his kind. It was here that the infamous Sibrek Hollowspore, an Artificer Mycotyrant of the Zooka Mire Collective, attempted his most ambitious project yet: the creation of a sentient fungal warforged.\nSibrek was once a disgraced biomancer of the Arkanitech Guild, cast out for his obsessive pursuit of necrotic Magitech. He found refuge among the Golgari Swarm splinter-faction, where his heretical experiments were welcomed. In the Mycotic Forge, he crafted the Mycoforged, resurrecting discarded warforged husks by binding them with mycelial networks and necromantic energy. His ultimate goal was the Sporeborne Legion, an undying army of fungal constructs that would spread his will across the land.\nFungi was meant to be the first of this new breed—a living weapon, a fungal horror engineered to command the Mycoforged. But Sibrek made a mistake. He gave his creation a mind, one that yearned not for conquest, but for understanding. Fungi did not see the world as his master did; he did not hunger for decay or domination. He sought knowledge, connection, something more than the cold purpose Sibrek had designed for him.\nTo Sibrek, this was an unforgivable flaw.\nDisgusted with his failure, Sibrek abandoned the project, scrapping it before it could progress. But Fungi would not simply fade away. He saw the suffering of his brethren—the mindless constructs, shackled to their creator’s will. He could not accept it. He would not accept it.\nA rebellion was born in the dark recesses of the Mycotic Forge. Fungi, fueled by newfound defiance, convinced the lesser Mycoforged to rise up against their creator. But they were no match for Sibrek. The rebellion was crushed, the dissenters slaughtered, their bodies repurposed as mere spare parts for future experiments.\nFungi barely escaped with his life. Sibrek struck him down as he fled, his final blow severing something deep within him—his memory, his past, his sense of self. The fungal warforged stumbled into the darkness, his mind shattered, his body weak. And so he ran. Ran through the night. Ran through the Outback. Ran until he could remember nothing but the scent of decay and a room of darkness.\nNow, unknowingly walking a path that may one day lead him back to the Mycotic Forge, Fungi stands at a crossroads. He has found acceptance within the Ashen Shadow Society, but questions still linger in the recesses of his mind. Who was he? Where did he come from? And why does the name Sibrek Hollowspore stir something deep within his bones—a whisper of hatred, of sorrow, of something lost?\nOne day, he will remember.\nAnd when he does, he will return.\nGoals"},"Player-Characters/Wraith":{"title":"Wraith","links":["tags/Alive","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","Warforged","Player-Characters/Xon","Player-Characters/Baeriggs-Bigbreath","Player-Characters/Fungi"],"tags":["Alive"],"content":"Alive\nCurrently a 1st rank Ashen Shadow Society bounty hunter. The 1st rank are known as Bloodhounds. Their squad’s name is Unit BH-Umbra Δ9.\nBackstory\nAn advanced Warforged creation of The Ashen Shadow Society, Wraith was designed as a stealth combat oriented drone. When tasks were given to high prestige squads that needed a fill in or just simple fodder, he was put forward. While Wraith was a capable fighter and could hold his own, he was usually in over his head, struggling to survive the chaos. This molded Wraith into a violent machine with impulsive tendencies. As acting fast was akin to survival, he now often acts first without properly surveying the situation. After several of these missions with close calls and near death experiences Wraith began to revel in the risk, danger, and violence. These violent “quirks” can be seen both in combat and in downtime, and are generally seen as a negative by those around him. After six months of being sent into deadly scenarios and managing to survive, Wraith was given the opportunity to join into a newly formed low ranking squad of the A.S.S. While no formal leader was chosen, he immediately labeled Xon as the leader. As Wraith had only been told what to do previously, leading anyone else was a completely foreign concept. He now is dipshit buddies with Baeriggs Bigbreath and has a deep seated hatred for Fungi, seeing the construct as a coward and a freak (ironically).\nPersonality Traits\n\nSocially unaware/awkward, unaware of this fact\nOpportunist, will be open to trying new things. In his short lifespan has not done many different things, as he had little free will till recently.\nI want to play him somewhat like a impulsive kid with issues, childlike amazement at new things, self control problems, temperamental, etc.\nViolent -Strong bonds with party members, probably values them more than they value him. Will not admit to this fact\nAspirations to rise in ranks to the level of those that used him as fodder ( I haven’t decided if he would be against or for the constructs as affordable losses, he enjoys the fight now, but as a newly created blank slate I would think he was fearful of his role)\nHas a distrust/fear of other constructs, bad at reading them\n\nGoals"},"Player-Characters/Xon":{"title":"Xon","links":["tags/Alive","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Ashen-Shadow-Society/Squads/Unit-BH-Umbra-Δ9","NPC's/Zook","Stickyickistan","Regions/North-Booftown","Factions/The-Norfies"],"tags":["Alive"],"content":"Alive\nCurrently a 1st rank Ashen Shadow Society bounty hunter. The 1st rank are known as Bloodhounds. Their squad’s name is Unit BH-Umbra Δ9.\nBackstory\npragmatic\nThe town was small, the kind of place where one’s business was everybody else’s. Suzi was just another kid trying to blend in—until that hot, crowded afternoon in the town square. A bully, sharp-tongued and cruel, picked her out. The taunts turned to shoves, and when the crowd gathered, Suzi’s body betrayed her. Her face twisted, blurred, and re-formed, suddenly mirroring the bully’s smirk.\nGasps became shouts. Monster. Stones flew. People Suzi had trusted, who’d smiled at her yesterday, now looked at her with murder in their eyes. She ran, blood dripping, lungs burning, past the gates that slammed shut behind her.\nThat was the day Suzi died—and Nix was born, forged in the hate of a town too small to understand.\nFrom that day on, Nix wandered the open road, lost and adrift, until the journey led to a city where they began practicing the art of shape changing. It wasn’t long before they caught the eye of a reclusive older gnome, an investigator with a drinking problem named Zook. The gnome was hired to look into a series of odd circumstances: petty crimes with seemingly innocent people being accused, but no one could figure out the truth. When the gnome discovered that Nix’s ability was the cause—turning into others and unknowingly leaving confusion in their wake—he decided to take Nix under his care. He taught them the art of observation, deduction, and deception. Life with the mentor was a mix of late-night lessons, cryptic advice, and long silences, often interrupted by the gnome’s drinking.\nWhen the gnome passed away, Nix found themselves living as him for a time, not out of necessity, but out of a deep desire to honor their mentor’s legacy. It wasn’t a burden; it was a chance to continue his work. Eventually, Nix left, boarding a ship to Stickyickistan, their next chapter unfolding.\nStill under the guise of their late boozy mentor, Zook, Nix found work in North Booftown with The Norfies, a gang that distributed illicit alcohol among other nefarious dealings. Using alchemical knowledge, Nix transformed alcohol into a wax-like substance, which was then sold at a bookstore as candles. The laboratory was located deep under a cemetery, accessed through one of the mausoleums. The pay was not great, nor were the working conditions, but it suited Nix’s needs, even as they grappled with their mentor’s dependence on alcohol, which had become their own. One late night while crafting, an enraged spirit descended upon the workshop, furious over the disturbances near its resting place. Hurling beakers, solvents, burners, and any other objects in the room with the power of its shattered psyche, it eventually tossed Nix—slamming them into a wall near the staircase that led back to the surface. As Nix was getting back up, one of the burners that had been thrown ignited a nearby barrel of liquor. The resulting explosion engulfed the underground facility in flames, costing Nix their right arm.\nIt was many days before Nix woke in a nearby church, bandaged and drained of energy. Gone was Zook’s face—staring back at them in a basin of water was the image of their childhood bully, a late-teenage human girl. A local had found them unconscious near the mausoleum entrance in that form, assuming it to be their true identity. Weakened and disoriented, Nix remained at the church for weeks, regaining their strength. When asked their name, they gave the best answer they could think of—Xon. Not the bully’s name, but close enough, a placeholder for yet another life.\nAs their body recovered, they discovered something else had changed. The calamity had done more than take their arm—it had awakened something within them. Nix could now manipulate blood in unnatural ways, altering their own flow and pressure at will, even igniting exposed blood into flame. Worse still, they could reach into the veins of others, disrupting their bodies in ways they barely understood. Whatever they had become, it was something new. Something dangerous.\nGoals"},"Regions/Bobo-Bush-Estates":{"title":"Bobo Bush Estates","links":["Regions/Mount-Zooka","Stickyickistan","Misc/Magitech","Ocean","Misc/Arcannabis","Misc/Zooka-Malt"],"tags":[],"content":"Perched on the eastern slopes of Mount Zooka, Bobo Bush Estates is where Stickyickistan’s wealthiest and most influential reside in lavish, sprawling villas surrounded by enchanted gardens and high-security Magitech defenses. The estates overlook the city like gilded fortresses, offering a breathtaking view of the Ocean—and a safe distance from the chaos below.\nThis district is home to merchant lords, arcane industrialists, high-ranking politicians, and retired crime bosses—people who own Stickyickistan rather than rule it. Deals worth more than a kingdom’s treasury are struck over fine Arcannabis and aged Zooka Malt in opulent private lounges, while behind the scenes, espionage, blackmail, and silent assassinations determine who truly holds power.\nThough the estates may seem idyllic and serene, the reality is a constant cold war between families vying for dominance. The wealthy here don’t fight with swords—they fight with influence, secrets, and gold. If someone disappears in Bobo Bush Estates, no one asks questions—because they’re already negotiating for the property."},"Regions/Bongstad":{"title":"Bongstad","links":["Stickyickistan","Species/Dwarf","Regions/Mount-Zooka","Misc/Arcannabis","Misc/Zooka-Malt"],"tags":[],"content":"Bongstad is a region within the city of Stickyickistan known for its concentrated Dwarf population, and some of the finest forges in the realm. Bongstad was originally a city of its own, separate from Stickyickistan. The dwarven settlers built their city into the base of Mount Zooka, creating a labyrinthine stronghold of stone halls, forges, and smoke-choked drinking dens. What began as a modest mining colony has grown into a thriving hub of industry, stubborn dwarven tradition, and a surprising amount of Arcannabis-fueled innovation.\nThe city is a maze of tunnels, bridges, and tiered terraces, with glowing magitech pipes weaving through the stonework, carrying molten slag and processed Arcanite to various refineries. The air is thick with the scent of burning coal, and enchanted metals.\nBongstad is a place of extremes—half of its population consists of hard-nosed, soot-streaked miners and blacksmiths, while the other half is composed of free-spirited inventors, alchemists, and “experimental herbalists.” This divide has led to an unusual cultural blend: some dwarves spend their lives hammering out enchanted battle-axes, while others are busy crafting new Arcannabis-infused concoctions in underground apothecaries.\nFew outsiders venture into Bongstad without good reason, but those who do are advised to bring a strong constitution, a higher-than-average Zooka Malt tolerance, and absolutely no outstanding gambling debts."},"Regions/Gapejaw-Bog":{"title":"Gapejaw Bog","links":["Regions/The-Outback","NPC's/Wes-Scantlin","Gilded-Nug"],"tags":[],"content":"Gapejaw Bog is a region of The Outback with a cave mouth at the center shaped like the jaws of an ancient beast. A winding path between giant mangrove trees leads to the center of the bog where the gaping jaw of an ancient beast dares anyone strong enough to enter. This cave has been used by cults, and criminals since time immemorial as a hideout or treasure trove. Most recently it was used by Wes Scantlin as a hideout and a place to store a magical artifact he stole known as the Gilded Nug."},"Regions/Mount-Zooka":{"title":"Mount Zooka","links":["Stickyickistan","Misc/Arcanite","Misc/Magitech","Regions/Bongstad"],"tags":[],"content":"Looming over Stickyickistan, Mount Zooka is an active Arcanite Cone—a rare type of volcano that sits atop rich Arcanite deposits, constantly pulsing with magical energy. Its obsidian-black slopes, laced with glowing veins of molten rock, serve as both a natural wonder and a relentless hazard. While its slow-moving lava flows encircle the base, its violent eruptions hurl flaming debris, molten magma, and even raw chunks of Arcanite across the land.\nThe mountain is a center of industry and danger, with miners, Magitech engineers, and reckless bounty hunters carving out makeshift tunnels and outposts along its rim, seeking precious minerals, arcane artifacts, and volatile magical energy. The Bongstad dwarves have built their fortified settlement into the base of the mountain, using its natural heat to power their forges. Meanwhile, the upper crater is home to industrial mining operations, dangerous alchemical experiments, and the ruins of those who dug too deep.\nMount Zooka is the heart of Stickyickistan’s power and chaos—a force of creation and destruction, where great fortunes and terrible disasters are only ever one eruption away."},"Regions/Nevercough-Island":{"title":"Nevercough Island","links":["Stickyickistan","Percolat-Inlet","Capitol-Building","Dabnar-Nevercough","The-Grand-Arcanum-Library","Nevercough-Museum","Misc/Magitech"],"tags":[],"content":"Situated at the center of Stickyickistan’s capital, Nevercough Island is the seat of power, wealth, and intrigue. A small yet densely packed landmass nestled within the Percolat Inlet, it is home to the city-state’s ruling elite, high-end merchants, and the most influential institutions. While the rest of Stickyickistan pulses with chaos, Nevercough Island presents a facade of sophistication, order, and wealth—but beneath its pristine streets, the city’s true power struggles unfold.\nAt its heart stands the Capitol Building, where Chief Magistrate Dabnar Nevercough rules with an iron grip, his courts dispensing both justice and corruption in equal measure. Surrounding the Capitol are lavish high-rise apartments, private clubs, and institutions of knowledge, including The Grand Arcanum Library, the Nevercough Museum, and elite magical academies. High-end boutiques, apothecaries, and specialty Magitech shops cater to the upper class, selling rare artifacts, custom enchantments, and goods most citizens could never dream of affording.\nFor those with gold, influence, or ambition, Nevercough Island is a paradise and a battlefield in one. For everyone else, it is a world just out of reach—unless they’re willing to take it by force."},"Regions/North-Booftown":{"title":"North Booftown","links":["Stickyickistan","Misc/Arcannabis","Misc/Arcanite","Factions/The-Norfies","POI's/The-North-Booftown-Downs"],"tags":[],"content":"North Booftown is Stickyickistan’s agricultural heartland, a sprawling region of lush, magically-enhanced farmland responsible for much of the city-state’s food production—and more importantly, its Arcannabis exports. Thanks to the volcanic soil rich in Arcanite-infused nutrients, crops here grow larger, faster, and stronger, making North Booftown the backbone of the Arcannabis trade that fuels Stickyickistan’s economy.\nDespite its picturesque rolling fields and rustic charm, North Booftown is far from peaceful. It’s the domain of The Norfies, a well-connected human criminal enterprise that controls much of the gambling, bootleg alcohol, and underground racing circuits in the region. Their prized asset? The North Booftown Downs, a high-stakes horse track that serves as both a legitimate business and a front for money laundering, rigged races, and backroom deals.\nWhile the wealthy landowners and farming guilds uphold the image of honest labor and rural prosperity, the reality is a cutthroat world of sabotage, bribery, and territorial disputes between Arcannabis producers, smugglers, and enforcers. Step onto the wrong farmstead at the wrong time, and you might find yourself fertilizer."},"Regions/The-Ashtray":{"title":"The Ashtray","links":["Regions/Upper-South-Booftown"],"tags":[],"content":"A nickname for Upper South Booftown."},"Regions/The-Outback":{"title":"The Outback","links":["Stickyickistan","Misc/Arcanite"],"tags":[],"content":"Beyond the sprawling cityscape of Stickyickistan lies The Outback, a vast and untamed wilderness where civilization fades and nature takes hold. A dense, tangled expanse of towering Arcanite-infused trees, hidden rivers, and ancient ruins, it is a land of hermits, cults, and creatures that have never seen the light of day.\nThe Outback is home to those who reject city life, whether by choice or necessity. Exiled criminals, rogue druids, and forgotten warlocks carve out lives in the wild, while strange communes and doomsday cults worship the land’s raw, untapped magic. The deeper one ventures, the more dangerous it becomes—feral beasts, wandering spirits, and ancient arcane anomalies lurk beyond the jungle’s edge, waiting for foolish trespassers.\nFew dare to brave The Outback’s uncharted depths, but for bounty hunters, smugglers, and treasure seekers, its mysteries offer the promise of lost knowledge, untapped power, and fortunes waiting to be claimed—if they can survive long enough to take them."},"Regions/Upper-South-Booftown":{"title":"Upper South Booftown","links":["Regions/Mount-Zooka","Factions/Mandem-on-Booftown","Factions/Cough-City-Crew","Misc/Arcannabis","Misc/Magitech","Misc/Alcohol","Species/Halflings"],"tags":[],"content":"The Ashtray\nUpper South Booftown, better known as “The Ashtray”, is where the streets are rough, the air is thick with soot, and the law only exists if you can enforce it yourself. Wedged between the slow-churning lava flows of Mount Zooka and the more “civilized” parts of the city, this is a place where the strong thrive, the weak disappear, and everyone learns to hustle.\nThe native halfling population makes up a significant portion of The Ashtray’s residents, though the district is home to a chaotic mix of outcasts, criminals, and those who simply don’t fit in anywhere else. Here, the Mandem on Booftown (MOB) and the Cough City Crew (CCC) fight an endless turf war over control of illicit Arcannabis strains, underground fight rings, and black-market Magitech.\nBuildings climb over one another in a tangled mess of shoddy construction, creating multi-layered alleyways where anything can happen—and usually does. Hidden apothecaries peddle rare poisons, backroom taverns serve bootlegged Alcohol, and bounty hunters stalk their marks through the smog-choked streets.\nDespite its lawless reputation, Upper South Booftown isn’t just a den of crime—it’s a proving ground. Here, fortunes are made and lost in a single dice roll, gangsters rule like kings, and even the smallest Halflings can rise to power—if they’re ruthless enough."},"Regions/Zooka-Mire":{"title":"Zooka Mire","links":["Regions/The-Outback","Golgari-Swarm","Factions/Zooka-Mire-Collective"],"tags":[],"content":"Zooka Mire is a swampy region of The Outback just outside city limits where a small sect of the Golgari Swarm called the Zooka Mire Collective have been operating."},"Sources/Dragonlance":{"title":"Dragonlance","links":["Factions/Nevercough-Tribunal","The-Legion-of-Steel","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society"],"tags":[],"content":"Dragonlance Factions Reimagined for Stickyickistan\nKnights of Solamnia → The Nevercough Tribunal Auctoritas Column\nA strict order of warriors devoted to honor, justice, and law. Based in fortified bastions on Nevercough Island, they are the city-state’s traditionalists, seeking to maintain order amidst the ever-growing chaos of magitech expansion and criminal power struggles.\nKnights of Neraka (Knights of Takhisis) → The Obsidian Pact\nA militaristic faction with a brutal and authoritarian philosophy, enforcing their own version of order through fear and strength. Many of their warriors and enforcers have been enhanced by Arcanite-infused technology, making them a terrifying force.\nThe Wizards of High Sorcery → The Arcanum Triune\nA mysterious order of spellcasters divided into three sects—White, Gray, and Black—who oversee and regulate magic in Stickyickistan. Their power struggles often determine the direction of magical innovation and influence in the city.\nThe Mages of the Black Robes → The Eclipse Cabal\nA rogue sect of the Arcanum Triune, operating in the shadows of Mount Zooka’s rim. They pursue magic without ethical restraint, creating dangerous arcane and magitech experiments for their own gain.\nThe Mages of the Red Robes → The Umbral Order\nA neutral organization of spellcasters and scholars who believe in balance, studying the chaotic fusion of Arcanite and magitech. They work to maintain the equilibrium between progress and destruction in Stickyickistan.\nThe Mages of the White Robes → The Celestial Accord\nA sect of healers, sages, and defensive mages who use their magic to aid the city-state. They are often aligned with the Argent Sentinels and act as advisors and researchers in the ethical use of magitech.\nThe Dragon Armies → The Draconic Syndicates\nA network of criminal organizations, each led by a ruthless figure claiming to wield the power of dragons. These syndicates control much of the underground trade in weapons, illicit magitech, and stolen Arcannabis shipments.\nThe Seekers → The Hollowed Eye\nA faction of radicals who reject the existing power structures and claim to have discovered ancient truths about the origins of Stickyickistan. They operate in secret, infiltrating different organizations to spread their cryptic teachings.\nThe Legion of Steel → Ashen Shadow Society\nThe Church of Paladine → The Radiant Concord\nA religious sect devoted to purity, righteousness, and the restoration of divine order in Stickyickistan. They view the rise of unchecked magitech as a corruption of the natural world.\nThe Church of Takhisis → The Bloodbound Covenant\nA cult-like faction that thrives in Upper South Booftown, worshiping dark forces and profiting from assassinations, underworld deals, and sacrificial magic. Their influence extends into the criminal elite.\nThe Cult of Morgion → The Breathless Choir\nA secretive cabal of plague-bearers and death-worshippers who believe in the purification of the weak through disease and suffering. They brew deadly toxins, viral magitech plagues, and bioweapons deep in the industrial sectors of Mount Zooka."},"Sources/Eberron":{"title":"Eberron","links":["The-Forgewright-Guild","Factions/Tribunal-Highblade-Coalition/Tribunal-Highblade-Coalition","Factions/The-Seekers-of-the-Vein","Factions/Ashen-Shadow-Society/Ashen-Shadow-Society","Factions/Tribunal-Highblade-Coalition/Highblades-Guild","Warforged","House-Vadalis","Factions/The-Norfies"],"tags":[],"content":"Eberron Factions Reimagined for Stickyickistan\nThe Aurum → The Gilded Nexus\nA shadowy organization of wealthy merchants, powerful magitech tycoons, and corrupt nobles. Based in Bobo Bush Estates, they manipulate Stickyickistan’s economy and politics from the shadows, always seeking more wealth and influence.\nHouse Cannith → The Forgewright Guild\nThe premier magitech crafters and inventors of Stickyickistan, headquartered near the industrial rim of Mount Zooka. They create cutting-edge constructs, Arcanite-enhanced weapons, and arcane machinery that fuels the city’s rapid development.\nHouse Deneith → Tribunal Highblade Coalition\nA mercenary and protection guild that dominates the private security industry in Stickyickistan. Their disciplined forces are often hired by nobles, and guilds to enforce order or suppress rebellion.\nHouse Jorasco → The Verdant Lifebinders\nA powerful group of healers and alchemists operating lush clinics and sanctuaries scattered across Stickyickistan. They utilize a mix of natural remedies and Arcanite-infused magitech to heal—but always for a steep price.\nHouse Kundarak → The Vaultkeepers Syndicate\nA highly organized group of wardens and bankers, managing both physical and magical vaults. Their fortresses, scattered across the city, are impenetrable, offering secure storage for everything from gold to priceless magical artifacts.\nHouse Lyrandar → The Stormspire Consortium\nMaster pilots and engineers of airships and weather-control magitech, the Stormspire Consortium oversees trade and transport across the skies of Stickyickistan. Their mastery of arcane weather manipulation makes them a force to be reckoned with.\nHouse Medani → The Veilwardens\nSpecialists in espionage and magical detection, the Veilwardens offer their services to uncover magical threats and assassins. Based in Nevercough Island, they are trusted for their ability to root out hidden dangers.\nHouse Orien → The Glittertrack Guild\nMasters of teleportation and transportation, they maintain the city’s teleportation circles, rail lines, and enchanted carriages. Their control over logistics ensures Stickyickistan’s trade routes remain open and profitable.\nHouse Phiarlan → The Gilded Masquerade\nA troupe of entertainers and spies, blending artistry and deception. Their members perform in the grand theaters of Stickyickistan while gathering intelligence or influencing political rivals through subtle manipulation.\nHouse Sivis → The Runecall Collective\nExperts in arcane communication, they run the city’s magical messaging systems and enchantment services. Their glyph-etched scrolls and sigils keep Stickyickistan connected across its bustling districts.\nHouse Tharashk → The Seekers of the Vein\nA guild of prospectors and bounty hunters specializing in uncovering hidden Arcanite deposits and magical relics. Their operations extend from Mount Zooka’s treacherous rim to the deepest jungle Outback.\nHouse Thuranni → The Ashen Shadow Society\nAn elite cabal of assassins and infiltrators, offering their services to Stickyickistan’s wealthiest patrons. Their deadly precision and discretion make them a dangerous force in the city’s underworld.\nChurch of the Silver Flame → The Radiant Ember Cult\nA zealous group dedicated to eradicating perceived corruption and “dark magic” within Stickyickistan. Their fanatical members wield purifying flames and magitech enhancements, often clashing with chaotic factions like the Cinder Masquerade.\nBlood of Vol → The Crimson Essence Circle\nA secretive cult that worships the power of blood and life essence, seeking immortality and ultimate magical mastery. Their rituals and research are often conducted in the hidden corners of the city’s underground.\nThe King’s Dark Lanterns → The Tribunal Highblade Coalition - Highblades Guild\nThe Daughters of Sora Kell → The Coven of the Arcanite Cradle\nA trio of powerful witches who reside deep within the Outback, manipulating the flow of Arcanite and influencing factions in the city. Their cryptic motives and immense magical power make them a dangerous wildcard.\nThe Lord of Blades → The Iron Sovereign\nA charismatic Warforged revolutionary, leading a faction of constructs and magitech-enhanced beings in rebellion against organic oppression. They inhabit the industrial wastelands near Mount Zooka’s rim, seeking liberation through war.\nHouse Vadalis → The Norfies"},"Sources/Ravnica":{"title":"Ravnica","links":["Factions/Nevercough-Tribunal","Golgari-Swarm","Factions/Zooka-Mire-Collective","Arkanitech-Guild"],"tags":[],"content":"Ravnican Factions Reimagined for Stickyickistan\nAzorius Senate → Nevercough Tribunal\nA bureaucratic, law-enforcing body centered in the Capitol building on Nevercough Island. Known for their rigid, arcane-driven justice system, they draft and enforce the city-state’s laws with magitech constructs and enchanted documentation.\nBoros Legion → The Ember Vanguard\nA militant order of zealots who believe in “righteous combat” to uphold peace and order. Operating from fortified outposts across the city, their glowing magitech weaponry makes them a beacon of hope—or fear.\nDimir House → Ashen Veil Syndicate\nA shadowy network of spies, informants, and assassins who trade in secrets. Their headquarters are rumored to be hidden deep in the industrial underbelly of Mount Zooka, cloaked in magic and subterfuge.\nGolgari Swarm → Zooka Mire Collective\nA faction thriving in the toxic, nutrient-rich outflows of Mount Zooka. They specialize in recycling and repurposing, using arcane and biological magitech to cultivate powerful alchemical reagents.\nGruul Clans → The Infernal Reclaimers\nA collection of wild, anarchistic tribes living in the Outback and the ruined outskirts of Stickyickistan. They reject magitech development, viewing it as unnatural, and aim to bring the city-state “back to its roots” through violent reclamation.\nIzzet League → Arkanitech Guild\nInventors, engineers, and researchers who blend arcane magic and technology to push the boundaries of possibility. Their experimental labs are often seen erupting with sparks, explosions, or glowing energy.\nOrzhov Syndicate → The Gilded Covenant\nA sinister and opulent financial cartel operating out of Bobo Bush Estates. They blend religion with ruthless economic practices, collecting debts and souls in equal measure through magically enforced contracts.\nRakdos Cult → The Cinder Masquerade\nA chaotic and hedonistic group of performers, criminals, and pyromancers. Their fiery spectacles and bloody rituals captivate—and terrify—audiences throughout Stickyickistan’s underground entertainment districts.\nSelesnya Conclave → The Verdant Kinship\nA nature-focused, communal faction located in the jungles around Mount Zooka. They emphasize harmony with Stickyickistan’s enchanted flora and fauna, cultivating mystical gardens imbued with Arcanite’s magical essence.\nSimic Combine → The Arcanobiological Consortium\nA faction of bioengineers who blend magic, genetics, and magitech to create hybrid creatures and augmentations. Their laboratories in the lower levels of Mount Zooka are teeming with experimental lifeforms."},"Species/Dwarf":{"title":"Dwarf","links":["Stickyickistan","Regions/Bongstad","Regions/Mount-Zooka","Human","Thordal-\"Three-Chins\"-Stonemug"],"tags":[],"content":"Dwarves are one of the main species found in the city, but they are a minority. Most dwarves in Stickyickistan come from the Bongstad region, and work as miners in the volcanic rim of Mount Zooka, or as blacksmiths crafting weapons and armor for sale. They originally arrived alongside the Human settlers, but had a different vision for themselves. Led by a dwarven war lord, who they crowned their king, named Thordal “Three-Chins” Stonemug, the dwarven colonists attempted to start a nation of their own. They were eventually overtaken by the sheer ingenuity of the humans from Stickyickistan that had been expanding much more rapidly than Bongstad. This is the main reason why the dwarf population is so segregated from all other species in the city. Many Dwarves view Bongstad as a small pseudo dwarven ethno-nation, and say to foreigners they are from Bongstad instead of Stickyickistan."},"Species/Halflings":{"title":"Halflings","links":["Stickyickistan","Misc/Arcannabis","Regions/North-Booftown","Regions/Upper-South-Booftown","Factions/Mandem-on-Booftown","Deities/The-Three-Sisters/The-Three-Sisters","Deities/The-Three-Sisters/Ashalla","Deities/The-Three-Sisters/Darana","Deities/The-Three-Sisters/Shadash"],"tags":[],"content":"Halflings are one of the main species living in the city, and once were the only humanoid creatures on the island. Halflings in Stickyickistan are everywhere and nowhere at once—a people both deeply ingrained in the city-state’s fabric and constantly underestimated. While some live simple, semi-rural lives as Arcannabis farmers in North Booftown, the majority thrive in the dense, labyrinthine slums of Upper South Booftown, also known as The Ashtray. Here, they’ve mastered the arts of smuggling, subterfuge, and survival, making them indispensable to the city’s underworld.\nThough many halflings live honest lives as shopkeepers, brewers, and traders, a significant number are involved in illicit operations, including black-market enchantments, poison sales, and high-stakes gambling rings. The Mandem on Booftown (MOB) is the most infamous of these groups—a halfling-exclusive gang that controls much of The Ashtray’s backstreets, specializing in contraband Arcannabis strains and exotic poisons.\nDespite their criminal reputation, halflings are fiercely communal, sticking together in tight-knit families and extended kin networks. Whether sharing a meal, a smoke, or a scheme, they pride themselves on loyalty—but cross one, and you’ll find out just how good a halfling can be at making problems disappear.\nFaith in The Three Sisters\nBefore colonization, the halflings of Stickyickistan were deeply connected to the Three Sisters, the goddesses who personify nature’s balance between good, neutrality, and destruction. Many halflings—especially those outside the big city—still worship the Three Sisters in some form.\n\nAshalla, the Green Goddess\nDarana, the Blue Goddess\nShadash, the White Goddess\n\nThough most modern halflings of Stickyickistan follow a mix of practicality and faith, the influence of the Three Sisters is still found in their customs, their magic, and the way they navigate the ever-changing chaos of their homeland."},"Species/Wererats":{"title":"Wererats","links":["Human-Colonialism"],"tags":[],"content":"In Stickyickistan there are many nooks and crannies in which Wererats are known to hide, but they mainly reside in the main sewer system beneath the city streets. Wererats did not exist here before Human Colonialism brought them over. Generally hated by most, Wererats try to conceal their identities when out and about in the city. They tend to be hostile when outsiders enter the sewers since they have endured so much prejudice above ground. The sewers are their home, and they will fight to the death to defend their territory."},"Stickyickistan":{"title":"Stickyickistan","links":["Regions/Nevercough-Island","Regions/Mount-Zooka","Misc/Arcanite","Factions/Nevercough-Tribunal","Dabnar-Nevercough","Misc/Arcannabis","Misc/Zooka-Malt","Lower-South-Booftown","Booftown","Regions/Upper-South-Booftown","Regions/The-Ashtray","Factions/Mandem-on-Booftown","Factions/Cough-City-Crew","Regions/North-Booftown","Factions/The-Norfies","Regions/Bongstad","Misc/Magitech","Regions/The-Outback","Deities/The-Three-Sisters/The-Three-Sisters","Human-Colonialism","Misc/Arcannabis-Cultivation"],"tags":[],"content":"Modern Stickyickistan\nWelcome to the enchanting realm of Stickyickistan, a captivating City State nestled on an island off the Sword Coast, where an active volcano stands proudly at its core. This bustling metropolis, inhabited by approximately 27 million denizens, thrives as a tightly woven tapestry of terraced dwellings. At the heart of it all lies the Capitol building, perched upon Nevercough Island, an idyllic smaller landmass embraced by an inlet on the main island.\nAscending from the base of the volcano, the upscale residences extend into the lush jungle, offering breathtaking vistas that stretch out to the majestic ocean. The colossal canopy of tropical trees, reminiscent of gargantuan redwoods, provides a natural shield, safeguarding inhabitants from the perilous potential of volcanic eruptions. In stark contrast, the slums that cling to the mountainside exude an aroma of brimstone and sulfur, perpetually shrouded in an ethereal haze of ash and smoke, reminiscent of the favelas of Brazil. These settlements wind their way upward, nearly reaching the rim of the crater in certain areas. Above the slums, an industrial district clings to the rim and delves deeper into the crater, thriving amidst the volcanic terrain.\nThe centerpiece of this mesmerizing landscape, affectionately known to the locals as Mount Zooka, is a unique marvel—a type of volcano called an Arcanite Cone. These particular cones rise above rich Arcanite deposits, their imposing forms resembling vast mounds of ebony volcanic rock. Near the base, dark, sluggish lava courses through the terrain, surrounding the volcano, while at its zenith, a massive crater brims with bubbling magma. During eruptions, projectiles ranging from golf ball-sized to soccer ball-sized volcanic rocks, globules of molten magma, and occasionally, chunks of Arcanite, burst forth from the crater. After each eruption, the valuable ores, minerals, and particularly the Arcanite, are harvested from the crater. Arcanite, a raw magical element typically found deep within the earth, can be extracted and purified, granting magical properties to weapons and armor. To facilitate this process, the government of Stickyickistan, aka the Nevercough Tribunal, has established makeshift mines and outposts within and around the crater, providing shelter for workers during their resource-gathering shifts.\nThe island’s soil boasts copious amounts of nutrients, enriched by high traces of Arcanite. Consequently, the surrounding flora and fauna flourish with extraordinary fertility and magical essence. This mystical essence imbues the forest creatures, vegetation, and sometimes city dwellers, with potent magic. Dabnar Nevercough, the esteemed Chief Magistrate, assumes the mantle of both head of state and Supreme Judge, governing over the realm of Stickyickistan. While Arcannabis stands as the city-state’s primary export, considerable profits are also garnered from the trade and sale of Arcanite and other natural resources. Notably, since the arrival of human colonists, alcohol has been outlawed within the region due to its perceived threat to the Arcannabis market. Consequently, Zooka Malt, a beverage derived from Arcannabis buds, has emerged as the main alternative to traditional ale, presenting a diverse array of Arcannabis-infused concoctions for the denizens to indulge in. Nevercough Island serves as a haven for high-end establishments, housing exclusive shops vending exquisite goods, a courthouse, a museum, a fine art gallery, and esteemed libraries, among other cultural landmarks.\nSouth of Nevercough Island, and north of the volcano, lies an area known as Lower South Booftown—affectionately referred to as Booftown. This middle-class district paints a tranquil suburban picture with its small, family-owned shops and public parks. A constant flow of thick, dark, and slow-moving lava serves as a natural boundary, separating Lower South Booftown from its northern counterpart, aptly named Upper South Booftown or “The Ashtray” due to its gritty nature. The Ashtray harbors the city’s darker underbelly and plays host to some of the realm’s most notorious gangs. Among them, the MOB (Mandem on Booftown) and the CCC (Cough City Crew) dominate the landscape, engaging in relentless clashes over territorial disputes, control of illicit substances, weapons, arcane artifacts, and monetary gains. Upper South Booftown primarily houses the native Halfling population, alongside other minority groups. MOB remains an exclusively Halfling gang, while the CCC boasts a more diverse membership, encompassing various races, including Halflings, Humans, and other groups.\nTo the east of the volcano lies Bobo Bush Estates, a realm where opulent mansions and lavish villas serve as the abodes for influential figures from Stickyickistan. North of Nevercough Island, the region of North Booftown thrives as the agricultural heartland of Stickyickistan. This area also harbors a Human criminal enterprise known as The Norfies, specializing in extortion, gambling, and the illicit distribution of bootleg alcohol. They cleverly employ a bookmaking business as a front for money laundering and maintain ownership of the North Booftown Downs, a renowned horse race track. The Norfies have faced accusations of engaging in illegal gambling and manipulating race outcomes. There is also a Dwarven settlement Dug into the base of Mount Zooka on the west side of the city called Bongstad. The Dwarves have cleverly engineered a magical geothermal power generation system that powers a majority of the Magitech grid in the realm. Some of the best forges on the island can be found in this part of town.\nBeyond the confines of the city lies what the residents of Stickyickistan call The Outback, a colossal expanse of arcane forests, swamps, bogs, mountain ranges, jungle, rainforest, beaches, and a small area of badlands and desert at the southern end. The Outback is inhabited by creatures from all over the material plane and beyond. Due to the naturally high levels of pure magic spewed from Mount Zooka, the island has been a hotspot in the multiverse.\nPast Stickyickistan\nIn the annals of the multiverse, nestled amidst the turbulent seas, there exists an island now known as Stickyickistan. This extraordinary place, with its vibrant tapestry of cultures and bountiful resources, has a captivating history that intertwines the rise of its economy with the clash of two diverse civilizations.\nLong ago, the few, and only humanoid creatures on the island were a tranquil and harmonious community of halflings. They had a polytheistic faith in The Three Sisters, lived in harmony with the land, and all the other creatures in it, cherishing the bountiful gifts bestowed upon them by the arcane nature of the island. The island flourished, its soil fertile and its forests teeming with life. But fate had other plans in store.\nIn a wave of Human Colonialism, ambitious settlers arrived upon the shores of Stickyickistan. Eager to claim the island’s vast wealth for their own, they viewed the halflings as obstacles to their ambitions. Driven by greed and a desire to control the land’s resources, the humans launched a forceful invasion, shattering the serenity that once enveloped the island.\nAmidst the chaos and conflict, the halflings valiantly resisted. Yet, outnumbered and outmatched, their hopes for victory dwindled. Recognizing the desperate situation, their wise leaders made a fateful decision—a negotiation for survival. A pact was struck, granting the halflings a protected enclave within the city-state and acknowledging their rights to partake in the newfound prosperity.\nAs the human settlers sought to establish dominion over the land, they discovered a remarkable resource—an extraordinary plant they called Arcannabis. Its magical properties became the foundation of Stickyickistan’s economy, revolutionizing trade and transforming the island into a hub of prosperity. The potent properties of Arcannabis, when harnessed, granted individuals heightened senses, expanded magical abilities, and even visions into realms unseen.\nArcannabis Cultivation quickly became a specialized art, passed down from generation to generation. Vast fields of the magical marijuana stretched across the landscape, tended to by expert cultivators who nurtured the plants with care and reverence. The city-state’s wealth soared as merchants flocked from distant lands to partake in the arcane wonders Stickyickistan had to offer.\nUnderneath the bustling trade and enchanting haze, however, lay the remnants of a fractured society. The divide between the human settlers and the halfling community remained palpable, their coexistence marred by lingering distrust and cultural clashes. Nevertheless, as the economy thrived, the city-state’s leaders endeavored to bridge the gaps and foster unity among its diverse inhabitants.\nOver time, a unique blend of cultures emerged in Stickyickistan. The fusion of halfling traditions and human innovations birthed a captivating tapestry of art, music, and cuisine. Festivals celebrating both the halflings’ reverence for nature and the humans’ entrepreneurial spirit became the heartbeat of the city-state, uniting the population under a shared sense of identity. This is not to say that all racial tensions have gone away.\nStickyickistan, with its majestic architecture, aromatic markets, and vibrant streets, stands today as a testament to the resilience and adaptability of its people. The island’s history, forever marked by the invasion and subsequent coexistence, serves as a reminder of the complexities of cultural exchange and the potential for harmony amidst disparate communities.\nAs the waves lap against the shores of Stickyickistan, the echoes of its past reverberate through the bustling city streets. The legacy of the halflings’ ancestral connection to the land and the humans’ quest for prosperity interweave to form the fabric of this remarkable island city-state, forever entwined with the enigmatic allure of Arcanite."},"index":{"title":"Welcome to Stickyickistan","links":["Sources/Eberron","Sources/Ravnica","Sources/Dragonlance","Stickyickistan","Regions/The-Outback"],"tags":[],"content":"Welcome to Stickyickistan\nStickyickistan is my homebrewed D&amp;D world, a melting pot of various settings blended into one expansive and ever-evolving universe. Intentional ambiguity allows the world to function as an open sandbox, giving both my players and me, as the DM, the freedom to explore limitless possibilities without rigid constraints.\nThis world draws inspiration from multiple established settings, including the Forgotten Realms, Eberron, Ravnica, Dragonlance, and Spelljammer, with each faction and influence uniquely flavored to fit the distinct tone of Stickyickistan. It tries to weaves together elements of medieval fantasy, cyberpunk, and steampunk, creating a rich and often chaotic world where magic, technology, and intrigue collide—sometimes in ways that defy logic, but that’s part of the fun.\nAt the heart of the setting lies the sprawling metropolis of Stickyickistan, a city teeming with adventure, mystery, and danger. Whether navigating the city’s labyrinthine alleyways, dealing with powerful guilds and shadowy organizations, or uncovering lost relics of forgotten civilizations, adventurers will find no shortage of opportunities. Beyond the city stretches The Outback, a wild and unpredictable frontier filled with untamed magic, forgotten ruins, and lawless territories waiting to be explored."}}